LaloAlvarez-e/ALIENTEK-STM32F767-/STM32F767_DriverLib/xDriver_MCU/Core/SCB/Peripheral/Register/RegisterDefines/SCB_RegisterDefines.h
/**
 *
 * @file SCB_RegisterDefines.h
 * @copyright
 * @verbatim InDeviceMex 2020 @endverbatim
 *
 * @par Responsibility
 * @verbatim InDeviceMex Developers @endverbatim
 *
 * @version
 * @verbatim 1.0 @endverbatim
 *
 * @date
 * @verbatim 22 jun. 2020 @endverbatim
 *
 * @author
 * @verbatim vyldram @endverbatim
 *
 * @par Change History
 * @verbatim
 * Date Author Version Description
 * 22 jun. 2020 vyldram 1.0 initial Version@endverbatim
 */
#ifndef XDRIVER_MCU_DRIVER_HEADER_SCB_SCB_PERIPHERAL_SCB_REGISTER_SCB_REGISTERDEFINES_H_
#define XDRIVER_MCU_DRIVER_HEADER_SCB_SCB_PERIPHERAL_SCB_REGISTER_SCB_REGISTERDEFINES_H_

#include <xDriver_MCU/Core/SCB/Peripheral/xHeader/SCB_Enum.h>
#include <xDriver_MCU/Core/SCB/Peripheral/Register/RegisterDefines/xHeader/SCB_RegisterDefines_INTCTLR.h>

/********************************************************************************************/
/************************************* 1 ICTLR ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_ICTLR_INTLINESNUM_MASK    ((UBase_t) 0x1FUL)
#define SCB_ICTLR_INTLINESNUM_0_32    ((UBase_t) 0x00UL)
#define SCB_ICTLR_INTLINESNUM_33_64    ((UBase_t) 0x01UL)
#define SCB_ICTLR_INTLINESNUM_65_96    ((UBase_t) 0x02UL)
#define SCB_ICTLR_INTLINESNUM_97_128    ((UBase_t) 0x03UL)
#define SCB_ICTLR_INTLINESNUM_129_160    ((UBase_t) 0x04UL)
#define SCB_ICTLR_INTLINESNUM_161_192    ((UBase_t) 0x05UL)
#define SCB_ICTLR_INTLINESNUM_193_224    ((UBase_t) 0x06UL)
#define SCB_ICTLR_INTLINESNUM_225_256    ((UBase_t) 0x07UL)

#define SCB_ICTLR_R_INTLINESNUM_BIT    (0UL)

#define SCB_ICTLR_R_INTLINESNUM_MASK    (SCB_ICTLR_INTLINESNUM_MASK << SCB_ICTLR_R_INTLINESNUM_BIT)
#define SCB_ICTLR_R_INTLINESNUM_0_32    (SCB_ICTLR_INTLINESNUM_0_32 << SCB_ICTLR_R_INTLINESNUM_BIT)
#define SCB_ICTLR_R_INTLINESNUM_33_64    (SCB_ICTLR_INTLINESNUM_33_64 << SCB_ICTLR_R_INTLINESNUM_BIT)
#define SCB_ICTLR_R_INTLINESNUM_65_96    (SCB_ICTLR_INTLINESNUM_65_96 << SCB_ICTLR_R_INTLINESNUM_BIT)
#define SCB_ICTLR_R_INTLINESNUM_97_128    (SCB_ICTLR_INTLINESNUM_97_128 << SCB_ICTLR_R_INTLINESNUM_BIT)
#define SCB_ICTLR_R_INTLINESNUM_129_160    (SCB_ICTLR_INTLINESNUM_129_160 << SCB_ICTLR_R_INTLINESNUM_BIT)
#define SCB_ICTLR_R_INTLINESNUM_161_192    (SCB_ICTLR_INTLINESNUM_161_192 << SCB_ICTLR_R_INTLINESNUM_BIT)
#define SCB_ICTLR_R_INTLINESNUM_193_224    (SCB_ICTLR_INTLINESNUM_193_224 << SCB_ICTLR_R_INTLINESNUM_BIT)
#define SCB_ICTLR_R_INTLINESNUM_225_256    (SCB_ICTLR_INTLINESNUM_225_256 << SCB_ICTLR_R_INTLINESNUM_BIT)
/*----------*/

/********************************************************************************************/
/************************************* 2 ACTLR ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_ACTLR_DISFOLD_MASK    ((UBase_t) 0x00000001UL)
#define SCB_ACTLR_DISFOLD_ENA    ((UBase_t) 0x00000000UL)
#define SCB_ACTLR_DISFOLD_DIS    ((UBase_t) 0x00000001UL)

#define SCB_ACTLR_R_DISFOLD_BIT    (2UL)

#define SCB_ACTLR_R_DISFOLD_MASK    (SCB_ACTLR_DISFOLD_MASK << SCB_ACTLR_R_DISFOLD_BIT)
#define SCB_ACTLR_R_DISFOLD_ENA    (SCB_ACTLR_DISFOLD_ENA << SCB_ACTLR_R_DISFOLD_BIT)
#define SCB_ACTLR_R_DISFOLD_DIS    (SCB_ACTLR_DISFOLD_DIS << SCB_ACTLR_R_DISFOLD_BIT)
/*----------*/

/*----------*/
#define SCB_ACTLR_FPEXCODIS_MASK    ((UBase_t) 0x00000001UL)
#define SCB_ACTLR_FPEXCODIS_ENA    ((UBase_t) 0x00000000UL)
#define SCB_ACTLR_FPEXCODIS_DIS    ((UBase_t) 0x00000001UL)

#define SCB_ACTLR_R_FPEXCODIS_BIT    (10UL)

#define SCB_ACTLR_R_FPEXCODIS_MASK    (SCB_ACTLR_FPEXCODIS_MASK << SCB_ACTLR_R_FPEXCODIS_BIT)
#define SCB_ACTLR_R_FPEXCODIS_ENA    (SCB_ACTLR_FPEXCODIS_ENA << SCB_ACTLR_R_FPEXCODIS_BIT)
#define SCB_ACTLR_R_FPEXCODIS_DIS    (SCB_ACTLR_FPEXCODIS_DIS << SCB_ACTLR_R_FPEXCODIS_BIT)
/*----------*/

/*----------*/
#define SCB_ACTLR_DISRAMODE_MASK    ((UBase_t) 0x00000001UL)
#define SCB_ACTLR_DISRAMODE_ENA    ((UBase_t) 0x00000000UL)
#define SCB_ACTLR_DISRAMODE_DIS    ((UBase_t) 0x00000001UL)

#define SCB_ACTLR_R_DISRAMODE_BIT    (11UL)

#define SCB_ACTLR_R_DISRAMODE_MASK    (SCB_ACTLR_DISRAMODE_MASK << SCB_ACTLR_R_DISRAMODE_BIT)
#define SCB_ACTLR_R_DISRAMODE_ENA    (SCB_ACTLR_DISRAMODE_ENA << SCB_ACTLR_R_DISRAMODE_BIT)
#define SCB_ACTLR_R_DISRAMODE_DIS    (SCB_ACTLR_DISRAMODE_DIS << SCB_ACTLR_R_DISRAMODE_BIT)
/*----------*/

/*----------*/
#define SCB_ACTLR_DISITMATBFLUSH_MASK    ((UBase_t) 0x00000001UL)
#define SCB_ACTLR_DISITMATBFLUSH_ENA    ((UBase_t) 0x00000000UL)
#define SCB_ACTLR_DISITMATBFLUSH_DIS    ((UBase_t) 0x00000001UL)

#define SCB_ACTLR_R_DISITMATBFLUSH_BIT    (12UL)

#define SCB_ACTLR_R_DISITMATBFLUSH_MASK    (SCB_ACTLR_DISITMATBFLUSH_MASK << SCB_ACTLR_R_DISITMATBFLUSH_BIT)
#define SCB_ACTLR_R_DISITMATBFLUSH_ENA    (SCB_ACTLR_DISITMATBFLUSH_ENA << SCB_ACTLR_R_DISITMATBFLUSH_BIT)
#define SCB_ACTLR_R_DISITMATBFLUSH_DIS    (SCB_ACTLR_DISITMATBFLUSH_DIS << SCB_ACTLR_R_DISITMATBFLUSH_BIT)
/*----------*/


/********************************************************************************************/
/************************************* 3 CPUID ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_CPUID_REVISION_MASK    ((UBase_t) 0x0000000FUL)
#define SCB_CPUID_REVISION_rnp0    ((UBase_t) 0x00000000UL)
#define SCB_CPUID_REVISION_rnp1    ((UBase_t) 0x00000001UL)
#define SCB_CPUID_REVISION_rnp2    ((UBase_t) 0x00000002UL)
#define SCB_CPUID_REVISION_rnp3    ((UBase_t) 0x00000003UL)
#define SCB_CPUID_REVISION_rnp4    ((UBase_t) 0x00000004UL)
#define SCB_CPUID_REVISION_rnp5    ((UBase_t) 0x00000005UL)
#define SCB_CPUID_REVISION_rnp6    ((UBase_t) 0x00000006UL)
#define SCB_CPUID_REVISION_rnp7    ((UBase_t) 0x00000007UL)
#define SCB_CPUID_REVISION_rnp8    ((UBase_t) 0x00000008UL)
#define SCB_CPUID_REVISION_rnp9    ((UBase_t) 0x00000009UL)
#define SCB_CPUID_REVISION_rnp10    ((UBase_t) 0x0000000AUL)
#define SCB_CPUID_REVISION_rnp11    ((UBase_t) 0x0000000BUL)
#define SCB_CPUID_REVISION_rnp12    ((UBase_t) 0x0000000CUL)
#define SCB_CPUID_REVISION_rnp13    ((UBase_t) 0x0000000DUL)
#define SCB_CPUID_REVISION_rnp14    ((UBase_t) 0x0000000EUL)
#define SCB_CPUID_REVISION_rnp15    ((UBase_t) 0x0000000FUL)

#define SCB_CPUID_R_REVISION_BIT    (0UL)

