LaloAlvarez-e/ALIENTEK-STM32F767-/STM32F767_DriverLib/xDriver_MCU/Core/SCB/Peripheral/Register/RegisterDefines/SCB_RegisterDefines.h
#define SCB_CPUID_R_REVISION_MASK    (SCB_CPUID_REVISION_MASK << SCB_CPUID_R_REVISION_BIT)
#define SCB_CPUID_R_REVISION_rnp0    (SCB_CPUID_REVISION_rnp0 << SCB_CPUID_R_REVISION_BIT)
#define SCB_CPUID_R_REVISION_rnp1    (SCB_CPUID_REVISION_rnp1 << SCB_CPUID_R_REVISION_BIT)
#define SCB_CPUID_R_REVISION_rnp2    (SCB_CPUID_REVISION_rnp2 << SCB_CPUID_R_REVISION_BIT)
#define SCB_CPUID_R_REVISION_rnp3    (SCB_CPUID_REVISION_rnp3 << SCB_CPUID_R_REVISION_BIT)
#define SCB_CPUID_R_REVISION_rnp4    (SCB_CPUID_REVISION_rnp4 << SCB_CPUID_R_REVISION_BIT)
#define SCB_CPUID_R_REVISION_rnp5    (SCB_CPUID_REVISION_rnp5 << SCB_CPUID_R_REVISION_BIT)
#define SCB_CPUID_R_REVISION_rnp6    (SCB_CPUID_REVISION_rnp6 << SCB_CPUID_R_REVISION_BIT)
#define SCB_CPUID_R_REVISION_rnp7    (SCB_CPUID_REVISION_rnp7 << SCB_CPUID_R_REVISION_BIT)
#define SCB_CPUID_R_REVISION_rnp8    (SCB_CPUID_REVISION_rnp8 << SCB_CPUID_R_REVISION_BIT)
#define SCB_CPUID_R_REVISION_rnp9    (SCB_CPUID_REVISION_rnp9 << SCB_CPUID_R_REVISION_BIT)
#define SCB_CPUID_R_REVISION_rnp10    (SCB_CPUID_REVISION_rnp10 << SCB_CPUID_R_REVISION_BIT)
#define SCB_CPUID_R_REVISION_rnp11    (SCB_CPUID_REVISION_rnp11 << SCB_CPUID_R_REVISION_BIT)
#define SCB_CPUID_R_REVISION_rnp12    (SCB_CPUID_REVISION_rnp12 << SCB_CPUID_R_REVISION_BIT)
#define SCB_CPUID_R_REVISION_rnp13    (SCB_CPUID_REVISION_rnp13 << SCB_CPUID_R_REVISION_BIT)
#define SCB_CPUID_R_REVISION_rnp14    (SCB_CPUID_REVISION_rnp14 << SCB_CPUID_R_REVISION_BIT)
#define SCB_CPUID_R_REVISION_rnp15    (SCB_CPUID_REVISION_rnp15 << SCB_CPUID_R_REVISION_BIT)
/*----------*/

/*----------*/
#define SCB_CPUID_PARTNO_MASK    ((UBase_t) 0x00000FFFUL)
#define SCB_CPUID_PARTNO_M4    ((UBase_t) 0x00000C24UL)
#define SCB_CPUID_PARTNO_M7    ((UBase_t) 0x00000C27UL)

#define SCB_CPUID_R_PARTNO_BIT    (4UL)

#define SCB_CPUID_R_PARTNO_MASK    (SCB_CPUID_PARTNO_MASK << SCB_CPUID_R_PARTNO_BIT)
#define SCB_CPUID_R_PARTNO_M4    (SCB_CPUID_PARTNO_M4 << SCB_CPUID_R_PARTNO_BIT)
#define SCB_CPUID_R_PARTNO_M7    (SCB_CPUID_PARTNO_M7 << SCB_CPUID_R_PARTNO_BIT)
/*----------*/

/*----------*/
#define SCB_CPUID_CON_MASK    ((UBase_t) 0x0000000FUL)

#define SCB_CPUID_R_CON_BIT    (16UL)

#define SCB_CPUID_R_CON_MASK    (SCB_CPUID_CON_MASK << SCB_CPUID_R_CON_BIT)
/*----------*/

/*----------*/
#define SCB_CPUID_VARIANT_MASK    ((UBase_t) 0x0000000FUL)
#define SCB_CPUID_VARIANT_r0pn    ((UBase_t) 0x00000000UL)
#define SCB_CPUID_VARIANT_r1pn    ((UBase_t) 0x00000001UL)
#define SCB_CPUID_VARIANT_r2pn    ((UBase_t) 0x00000002UL)
#define SCB_CPUID_VARIANT_r3pn    ((UBase_t) 0x00000003UL)
#define SCB_CPUID_VARIANT_r4pn    ((UBase_t) 0x00000004UL)
#define SCB_CPUID_VARIANT_r5pn    ((UBase_t) 0x00000005UL)
#define SCB_CPUID_VARIANT_r6pn    ((UBase_t) 0x00000006UL)
#define SCB_CPUID_VARIANT_r7pn    ((UBase_t) 0x00000007UL)
#define SCB_CPUID_VARIANT_r8pn    ((UBase_t) 0x00000008UL)
#define SCB_CPUID_VARIANT_r9pn    ((UBase_t) 0x00000009UL)
#define SCB_CPUID_VARIANT_r10pn    ((UBase_t) 0x0000000AUL)
#define SCB_CPUID_VARIANT_r11pn    ((UBase_t) 0x0000000BUL)
#define SCB_CPUID_VARIANT_r12pn    ((UBase_t) 0x0000000CUL)
#define SCB_CPUID_VARIANT_r13pn    ((UBase_t) 0x0000000DUL)
#define SCB_CPUID_VARIANT_r14pn    ((UBase_t) 0x0000000EUL)
#define SCB_CPUID_VARIANT_r15pn    ((UBase_t) 0x0000000FUL)

#define SCB_CPUID_R_VARIANT_BIT    (20UL)

#define SCB_CPUID_R_VARIANT_MASK    (SCB_CPUID_VARIANT_MASK << SCB_CPUID_R_VARIANT_BIT)
#define SCB_CPUID_R_VARIANT_r0pn    (SCB_CPUID_VARIANT_r0pn << SCB_CPUID_R_VARIANT_BIT)
#define SCB_CPUID_R_VARIANT_r1pn    (SCB_CPUID_VARIANT_r1pn << SCB_CPUID_R_VARIANT_BIT)
#define SCB_CPUID_R_VARIANT_r2pn    (SCB_CPUID_VARIANT_r2pn << SCB_CPUID_R_VARIANT_BIT)
#define SCB_CPUID_R_VARIANT_r3pn    (SCB_CPUID_VARIANT_r3pn << SCB_CPUID_R_VARIANT_BIT)
#define SCB_CPUID_R_VARIANT_r4pn    (SCB_CPUID_VARIANT_r4pn << SCB_CPUID_R_VARIANT_BIT)
#define SCB_CPUID_R_VARIANT_r5pn    (SCB_CPUID_VARIANT_r5pn << SCB_CPUID_R_VARIANT_BIT)
#define SCB_CPUID_R_VARIANT_r6pn    (SCB_CPUID_VARIANT_r6pn << SCB_CPUID_R_VARIANT_BIT)
#define SCB_CPUID_R_VARIANT_r7pn    (SCB_CPUID_VARIANT_r7pn << SCB_CPUID_R_VARIANT_BIT)
#define SCB_CPUID_R_VARIANT_r8pn    (SCB_CPUID_VARIANT_r8pn << SCB_CPUID_R_VARIANT_BIT)
#define SCB_CPUID_R_VARIANT_r9pn    (SCB_CPUID_VARIANT_r9pn << SCB_CPUID_R_VARIANT_BIT)
#define SCB_CPUID_R_VARIANT_r10pn    (SCB_CPUID_VARIANT_r10pn << SCB_CPUID_R_VARIANT_BIT)
#define SCB_CPUID_R_VARIANT_r11pn    (SCB_CPUID_VARIANT_r11pn << SCB_CPUID_R_VARIANT_BIT)
#define SCB_CPUID_R_VARIANT_r12pn    (SCB_CPUID_VARIANT_r12pn << SCB_CPUID_R_VARIANT_BIT)
#define SCB_CPUID_R_VARIANT_r13pn    (SCB_CPUID_VARIANT_r13pn << SCB_CPUID_R_VARIANT_BIT)
#define SCB_CPUID_R_VARIANT_r14pn    (SCB_CPUID_VARIANT_r14pn << SCB_CPUID_R_VARIANT_BIT)
#define SCB_CPUID_R_VARIANT_r15pn    (SCB_CPUID_VARIANT_r15pn << SCB_CPUID_R_VARIANT_BIT)
/*----------*/

/*----------*/
#define SCB_CPUID_IMPLEMENTER_MASK    ((UBase_t) 0x000000FFUL)
#define SCB_CPUID_IMPLEMENTER_ARM    ((UBase_t) 0x00000041UL)

#define SCB_CPUID_R_IMPLEMENTER_BIT    (24UL)

#define SCB_CPUID_R_IMPLEMENTER_MASK    (SCB_CPUID_IMPLEMENTER_MASK << SCB_CPUID_R_IMPLEMENTER_BIT)
#define SCB_CPUID_R_IMPLEMENTER_ARM    (SCB_CPUID_IMPLEMENTER_ARM << SCB_CPUID_R_IMPLEMENTER_BIT)
/*----------*/

/********************************************************************************************/
/************************************* 5 VTOR ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_VTOR_TBLOFF_MASK    ((UBase_t) 0x007FFFFFFUL)

#define SCB_VTOR_R_TBLOFF_BIT    (9UL)

#define SCB_VTOR_R_TBLOFF_MASK    (SCB_VTOR_TBLOFF_MASK << SCB_VTOR_R_TBLOFF_BIT)
/*----------*/

/********************************************************************************************/
/************************************* 6 AIRCR ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_AIRCR_VECTRESET_MASK    ((UBase_t) 0x00000001UL)
#define SCB_AIRCR_VECTRESET_NOUSE    ((UBase_t) 0x00000000UL)
#define SCB_AIRCR_VECTRESET_NOEFFECT    ((UBase_t) 0x00000001UL)

#define SCB_AIRCR_R_VECTRESET_BIT    (0UL)

#define SCB_AIRCR_R_VECTRESET_MASK    (SCB_AIRCR_VECTRESET_MASK << SCB_AIRCR_R_VECTRESET_BIT)
#define SCB_AIRCR_R_VECTRESET_NOUSE    (SCB_AIRCR_VECTRESET_NOUSE << SCB_AIRCR_R_VECTRESET_BIT)
#define SCB_AIRCR_R_VECTRESET_NOEFFECT    (SCB_AIRCR_VECTRESET_NOEFFECT << SCB_AIRCR_R_VECTRESET_BIT)
/*----------*/

/*----------*/
#define SCB_AIRCR_VECTCLRACTIVE_MASK    ((UBase_t) 0x00000001UL)
#define SCB_AIRCR_VECTCLRACTIVE_NOUSE    ((UBase_t) 0x00000000UL)
#define SCB_AIRCR_VECTCLRACTIVE_NOEFFECT    ((UBase_t) 0x00000001UL)

#define SCB_AIRCR_R_VECTCLRACTIVE_BIT    (1UL)

#define SCB_AIRCR_R_VECTCLRACTIVE_MASK    (SCB_AIRCR_VECTCLRACTIVE_MASK << SCB_AIRCR_R_VECTCLRACTIVE_BIT)
#define SCB_AIRCR_R_VECTCLRACTIVE_NOUSE    (SCB_AIRCR_VECTCLRACTIVE_NOUSE << SCB_AIRCR_R_VECTCLRACTIVE_BIT)
#define SCB_AIRCR_R_VECTCLRACTIVE_NOEFFECT    (SCB_AIRCR_VECTCLRACTIVE_NOEFFECT << SCB_AIRCR_R_VECTCLRACTIVE_BIT)
/*----------*/

/*----------*/
#define SCB_AIRCR_SYSRESETREQ_MASK    ((UBase_t) 0x00000001UL)
#define SCB_AIRCR_SYSRESETREQ_NOEFFECT    ((UBase_t) 0x00000000UL)
#define SCB_AIRCR_SYSRESETREQ_RESET    ((UBase_t) 0x00000001UL)

