LaloAlvarez-e/ALIENTEK-STM32F767-/STM32F767_DriverLib/xDriver_MCU/Core/SCB/Peripheral/Register/RegisterDefines/SCB_RegisterDefines.h
#define SCB_AIRCR_R_SYSRESETREQ_BIT    (2UL)

#define SCB_AIRCR_R_SYSRESETREQ_MASK    (SCB_AIRCR_SYSRESETREQ_MASK << SCB_AIRCR_R_SYSRESETREQ_BIT)
#define SCB_AIRCR_R_SYSRESETREQ_NOEFFECT    (SCB_AIRCR_SYSRESETREQ_NOEFFECT << SCB_AIRCR_R_SYSRESETREQ_BIT)
#define SCB_AIRCR_R_SYSRESETREQ_RESET    (SCB_AIRCR_SYSRESETREQ_RESET << SCB_AIRCR_R_SYSRESETREQ_BIT)
/*----------*/

/*----------*/
#define SCB_PRIGROUP_XXXX    (3UL)
#define SCB_PRIGROUP_XXXY    (4UL)
#define SCB_PRIGROUP_XXYY    (5UL)
#define SCB_PRIGROUP_XYYY    (6UL)
#define SCB_PRIGROUP_YYYY    (7UL)

#define SCB_AIRCR_PRIGROUP_MASK    ((UBase_t) 0x00000007UL)
#define SCB_AIRCR_PRIGROUP_XXXX    ((UBase_t) 0x00000003UL)
#define SCB_AIRCR_PRIGROUP_XXXY    ((UBase_t) 0x00000004UL)
#define SCB_AIRCR_PRIGROUP_XXYY    ((UBase_t) 0x00000005UL)
#define SCB_AIRCR_PRIGROUP_XYYY    ((UBase_t) 0x00000006UL)
#define SCB_AIRCR_PRIGROUP_YYYY    ((UBase_t) 0x00000007UL)

#define SCB_AIRCR_R_PRIGROUP_BIT    (8UL)

#define SCB_AIRCR_R_PRIGROUP_MASK    (SCB_AIRCR_PRIGROUP_MASK << SCB_AIRCR_R_PRIGROUP_BIT)
#define SCB_AIRCR_R_PRIGROUP_XXXX    (SCB_AIRCR_PRIGROUP_XXXX << SCB_AIRCR_R_PRIGROUP_BIT)
#define SCB_AIRCR_R_PRIGROUP_XXXY    (SCB_AIRCR_PRIGROUP_XXXY << SCB_AIRCR_R_PRIGROUP_BIT)
#define SCB_AIRCR_R_PRIGROUP_XXYY    (SCB_AIRCR_PRIGROUP_XXYY << SCB_AIRCR_R_PRIGROUP_BIT)
#define SCB_AIRCR_R_PRIGROUP_XYYY    (SCB_AIRCR_PRIGROUP_XYYY << SCB_AIRCR_R_PRIGROUP_BIT)
#define SCB_AIRCR_R_PRIGROUP_YYYY    (SCB_AIRCR_PRIGROUP_YYYY << SCB_AIRCR_R_PRIGROUP_BIT)
/*----------*/

/*----------*/

#define SCB_AIRCR_ENDIANESS_MASK    ((UBase_t) 0x00000001UL)
#define SCB_AIRCR_ENDIANESS_LITTLE    ((UBase_t) 0x00000000UL)
#define SCB_AIRCR_ENDIANESS_BIG    ((UBase_t) 0x00000001UL)

#define SCB_AIRCR_R_ENDIANESS_BIT    (15UL)

#define SCB_AIRCR_R_ENDIANESS_MASK    (SCB_AIRCR_ENDIANESS_MASK << SCB_AIRCR_R_ENDIANESS_BIT)
#define SCB_AIRCR_R_ENDIANESS_LITTLE    (SCB_AIRCR_ENDIANESS_LITTLE << SCB_AIRCR_R_ENDIANESS_BIT)
#define SCB_AIRCR_R_ENDIANESS_BIG    (SCB_AIRCR_ENDIANESS_BIG << SCB_AIRCR_R_ENDIANESS_BIT)
/*----------*/

/*----------*/

#define SCB_AIRCR_VECTKEY_MASK    ((UBase_t) 0x0000FFFFUL)
#define SCB_AIRCR_VECTKEY_READ    ((UBase_t) 0x0000FA05UL)
#define SCB_AIRCR_VECTKEY_WRITE    ((UBase_t) 0x000005FAUL)

#define SCB_AIRCR_R_VECTKEY_BIT    (16UL)

#define SCB_AIRCR_R_VECTKEY_MASK    (SCB_AIRCR_VECTKEY_MASK << SCB_AIRCR_R_VECTKEY_BIT)
#define SCB_AIRCR_R_VECTKEY_READ    (SCB_AIRCR_VECTKEY_READ << SCB_AIRCR_R_VECTKEY_BIT)
#define SCB_AIRCR_R_VECTKEY_WRITE    (SCB_AIRCR_VECTKEY_WRITE << SCB_AIRCR_R_VECTKEY_BIT)
/*----------*/

/********************************************************************************************/
/************************************* 7 SCR ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_SCR_SLEEPONEXIT_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SCR_SLEEPONEXIT_RUN    ((UBase_t) 0x00000000UL)
#define SCB_SCR_SLEEPONEXIT_SLEEP    ((UBase_t) 0x00000001UL)

#define SCB_SCR_R_SLEEPONEXIT_BIT    (1UL)

#define SCB_SCR_R_SLEEPONEXIT_MASK    (SCB_SCR_SLEEPONEXIT_MASK << SCB_SCR_R_SLEEPONEXIT_BIT)
#define SCB_SCR_R_SLEEPONEXIT_RUN    (SCB_SCR_SLEEPONEXIT_RUN << SCB_SCR_R_SLEEPONEXIT_BIT)
#define SCB_SCR_R_SLEEPONEXIT_SLEEP    (SCB_SCR_SLEEPONEXIT_SLEEP << SCB_SCR_R_SLEEPONEXIT_BIT)
/*----------*/

/*----------*/
#define SCB_SLEEPDEEP_SLEEP    (0UL)
#define SCB_SLEEPDEEP_DEEPSLEEP    (1UL)

#define SCB_SCR_SLEEPDEEP_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SCR_SLEEPDEEP_SLEEP    ((UBase_t) 0x00000000UL)
#define SCB_SCR_SLEEPDEEP_DEEPSLEEP    ((UBase_t) 0x00000001UL)

#define SCB_SCR_R_SLEEPDEEP_BIT    (2UL)

#define SCB_SCR_R_SLEEPDEEP_MASK    (SCB_SCR_SLEEPDEEP_MASK << SCB_SCR_R_SLEEPDEEP_BIT)
#define SCB_SCR_R_SLEEPDEEP_SLEEP    (SCB_SCR_SLEEPDEEP_SLEEP << SCB_SCR_R_SLEEPDEEP_BIT)
#define SCB_SCR_R_SLEEPDEEP_DEEPSLEEP    (SCB_SCR_SLEEPDEEP_DEEPSLEEP << SCB_SCR_R_SLEEPDEEP_BIT)
/*----------*/

/*----------*/
#define SCB_SCR_SEVONPEND_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SCR_SEVONPEND_ONLY    ((UBase_t) 0x00000000UL)
#define SCB_SCR_SEVONPEND_ALL    ((UBase_t) 0x00000001UL)

#define SCB_SCR_R_SEVONPEND_BIT    (4UL)

#define SCB_SCR_R_SEVONPEND_MASK    (SCB_SCR_SEVONPEND_MASK << SCB_SCR_R_SEVONPEND_BIT)
#define SCB_SCR_R_SEVONPEND_ONLY    (SCB_SCR_SEVONPEND_ONLY << SCB_SCR_R_SEVONPEND_BIT)
#define SCB_SCR_R_SEVONPEND_ALL    (SCB_SCR_SEVONPEND_ALL << SCB_SCR_R_SEVONPEND_BIT)
/*----------*/

/********************************************************************************************/
/************************************* 8 CCR ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_CCR_NONBASETHREDENA_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CCR_NONBASETHREDENA_ONLY    ((UBase_t) 0x00000000UL)
#define SCB_CCR_NONBASETHREDENA_ALL    ((UBase_t) 0x00000001UL)

#define SCB_CCR_R_NONBASETHREDENA_BIT    (0UL)

#define SCB_CCR_R_NONBASETHREDENA_MASK    (SCB_CCR_NONBASETHREDENA_MASK << SCB_CCR_R_NONBASETHREDENA_BIT)
#define SCB_CCR_R_NONBASETHREDENA_ONLY    (SCB_CCR_NONBASETHREDENA_ONLY << SCB_CCR_R_NONBASETHREDENA_BIT)
#define SCB_CCR_R_NONBASETHREDENA_ALL    (SCB_CCR_NONBASETHREDENA_ALL << SCB_CCR_R_NONBASETHREDENA_BIT)
/*----------*/

/*----------*/
#define SCB_CCR_USERSETMPEND_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CCR_USERSETMPEND_DIS    ((UBase_t) 0x00000000UL)
#define SCB_CCR_USERSETMPEND_ENA    ((UBase_t) 0x00000001UL)

#define SCB_CCR_R_USERSETMPEND_BIT    (1UL)

#define SCB_CCR_R_USERSETMPEND_MASK    (SCB_CCR_USERSETMPEND_MASK << SCB_CCR_R_USERSETMPEND_BIT)
#define SCB_CCR_R_USERSETMPEND_DIS    (SCB_CCR_USERSETMPEND_DIS << SCB_CCR_R_USERSETMPEND_BIT)
#define SCB_CCR_R_USERSETMPEND_ENA    (SCB_CCR_USERSETMPEND_ENA << SCB_CCR_R_USERSETMPEND_BIT)
/*----------*/

/*----------*/
#define SCB_CCR_UNALIGN_TRP_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CCR_UNALIGN_TRP_NOOCCUR    ((UBase_t) 0x00000000UL)
#define SCB_CCR_UNALIGN_TRP_OCCUR    ((UBase_t) 0x00000001UL)

#define SCB_CCR_R_UNALIGN_TRP_BIT    (3UL)

