LaloAlvarez-e/ALIENTEK-STM32F767-/STM32F767_DriverLib/xDriver_MCU/Core/SCB/Peripheral/Register/RegisterDefines/SCB_RegisterDefines.h
#define SCB_CCR_R_UNALIGN_TRP_MASK    (SCB_CCR_UNALIGN_TRP_MASK << SCB_CCR_R_UNALIGN_TRP_BIT)
#define SCB_CCR_R_UNALIGN_TRP_NOOCCUR    (SCB_CCR_UNALIGN_TRP_NOOCCUR << SCB_CCR_R_UNALIGN_TRP_BIT)
#define SCB_CCR_R_UNALIGN_TRP_OCCUR    (SCB_CCR_UNALIGN_TRP_OCCUR << SCB_CCR_R_UNALIGN_TRP_BIT)
/*----------*/

/*----------*/
#define SCB_CCR_DIV_0_TRP_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CCR_DIV_0_TRP_NOOCCUR    ((UBase_t) 0x00000000UL)
#define SCB_CCR_DIV_0_TRP_OCCUR    ((UBase_t) 0x00000001UL)

#define SCB_CCR_R_DIV_0_TRP_BIT    (4UL)

#define SCB_CCR_R_DIV_0_TRP_MASK    (SCB_CCR_DIV_0_TRP_MASK << SCB_CCR_R_DIV_0_TRP_BIT)
#define SCB_CCR_R_DIV_0_TRP_NOOCCUR    (SCB_CCR_DIV_0_TRP_NOOCCUR << SCB_CCR_R_DIV_0_TRP_BIT)
#define SCB_CCR_R_DIV_0_TRP_OCCUR    (SCB_CCR_DIV_0_TRP_OCCUR << SCB_CCR_R_DIV_0_TRP_BIT)
/*----------*/

/*----------*/
#define SCB_CCR_BFHFNMIGN_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CCR_BFHFNMIGN_NORMAL    ((UBase_t) 0x00000000UL)
#define SCB_CCR_BFHFNMIGN_IGNORE    ((UBase_t) 0x00000001UL)

#define SCB_CCR_R_BFHFNMIGN_BIT    (8UL)

#define SCB_CCR_R_BFHFNMIGN_MASK    (SCB_CCR_BFHFNMIGN_MASK << SCB_CCR_R_BFHFNMIGN_BIT)
#define SCB_CCR_R_BFHFNMIGN_NORMAL    (SCB_CCR_BFHFNMIGN_NORMAL << SCB_CCR_R_BFHFNMIGN_BIT)
#define SCB_CCR_R_BFHFNMIGN_IGNORE    (SCB_CCR_BFHFNMIGN_IGNORE << SCB_CCR_R_BFHFNMIGN_BIT)
/*----------*/

/*----------*/
#define SCB_CCR_STKALIGN_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CCR_STKALIGN_4BYTE    ((UBase_t) 0x00000000UL)
#define SCB_CCR_STKALIGN_8BYTE    ((UBase_t) 0x00000001UL)

#define SCB_CCR_R_STKALIGN_BIT    (9UL)

#define SCB_CCR_R_STKALIGN_MASK    (SCB_CCR_STKALIGN_MASK << SCB_CCR_R_STKALIGN_BIT)
#define SCB_CCR_R_STKALIGN_4BYTE    (SCB_CCR_STKALIGN_4BYTE << SCB_CCR_R_STKALIGN_BIT)
#define SCB_CCR_R_STKALIGN_8BYTE    (SCB_CCR_STKALIGN_8BYTE << SCB_CCR_R_STKALIGN_BIT)
/*----------*/

/*----------*/
#define SCB_CCR_DC_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CCR_DC_DIS    ((UBase_t) 0x00000000UL)
#define SCB_CCR_DC_ENA    ((UBase_t) 0x00000001UL)

#define SCB_CCR_R_DC_BIT    (16UL)

#define SCB_CCR_R_DC_MASK    (SCB_CCR_DC_MASK << SCB_CCR_R_DC_BIT)
#define SCB_CCR_R_DC_DIS    (SCB_CCR_DC_DIS << SCB_CCR_R_DC_BIT)
#define SCB_CCR_R_DC_ENA    (SCB_CCR_DC_ENA << SCB_CCR_R_DC_BIT)
/*----------*/

/*----------*/
#define SCB_CCR_IC_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CCR_IC_DIS    ((UBase_t) 0x00000000UL)
#define SCB_CCR_IC_ENA    ((UBase_t) 0x00000001UL)

#define SCB_CCR_R_IC_BIT    (17UL)

#define SCB_CCR_R_IC_MASK    (SCB_CCR_IC_MASK << SCB_CCR_R_IC_BIT)
#define SCB_CCR_R_IC_DIS    (SCB_CCR_IC_DIS << SCB_CCR_R_IC_BIT)
#define SCB_CCR_R_IC_ENA    (SCB_CCR_IC_ENA << SCB_CCR_R_IC_BIT)
/*----------*/

/*----------*/
#define SCB_CCR_BP_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CCR_BP_DIS    ((UBase_t) 0x00000000UL)
#define SCB_CCR_BP_ENA    ((UBase_t) 0x00000001UL)

#define SCB_CCR_R_BP_BIT    (19UL)

#define SCB_CCR_R_BP_MASK    (SCB_CCR_BP_MASK << SCB_CCR_R_BP_BIT)
#define SCB_CCR_R_BP_DIS    (SCB_CCR_BP_DIS << SCB_CCR_R_BP_BIT)
#define SCB_CCR_R_BP_ENA    (SCB_CCR_BP_ENA << SCB_CCR_R_BP_BIT)
/*----------*/

/********************************************************************************************/
/************************************* 9 SHPR1 ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_SHPR1_MEM_MASK    ((UBase_t) 0x0000000FUL)
#define SCB_SHPR1_MEM_PRI0    ((UBase_t) 0x00000000UL)
#define SCB_SHPR1_MEM_PRI1    ((UBase_t) 0x00000001UL)
#define SCB_SHPR1_MEM_PRI2    ((UBase_t) 0x00000002UL)
#define SCB_SHPR1_MEM_PRI3    ((UBase_t) 0x00000003UL)
#define SCB_SHPR1_MEM_PRI4    ((UBase_t) 0x00000004UL)
#define SCB_SHPR1_MEM_PRI5    ((UBase_t) 0x00000005UL)
#define SCB_SHPR1_MEM_PRI6    ((UBase_t) 0x00000006UL)
#define SCB_SHPR1_MEM_PRI7    ((UBase_t) 0x00000007UL)
#define SCB_SHPR1_MEM_PRI8    ((UBase_t) 0x00000008UL)
#define SCB_SHPR1_MEM_PRI9    ((UBase_t) 0x00000009UL)
#define SCB_SHPR1_MEM_PRI10    ((UBase_t) 0x000000AUL)
#define SCB_SHPR1_MEM_PRI11    ((UBase_t) 0x0000000BUL)
#define SCB_SHPR1_MEM_PRI12    ((UBase_t) 0x0000000CUL)
#define SCB_SHPR1_MEM_PRI13    ((UBase_t) 0x0000000DUL)
#define SCB_SHPR1_MEM_PRI14    ((UBase_t) 0x0000000EUL)
#define SCB_SHPR1_MEM_PRI15    ((UBase_t) 0x0000000FUL)

#define SCB_SHPR1_R_MEM_BIT    (0UL + 4UL)

#define SCB_SHPR1_R_MEM_MASK    (SCB_SHPR1_MEM_MASK << SCB_SHPR1_R_MEM_BIT)
#define SCB_SHPR1_R_MEM_PRI0    (SCB_SHPR1_MEM_PRI0 << SCB_SHPR1_R_MEM_BIT)
#define SCB_SHPR1_R_MEM_PRI1    (SCB_SHPR1_MEM_PRI1 << SCB_SHPR1_R_MEM_BIT)
#define SCB_SHPR1_R_MEM_PRI2    (SCB_SHPR1_MEM_PRI2 << SCB_SHPR1_R_MEM_BIT)
#define SCB_SHPR1_R_MEM_PRI3    (SCB_SHPR1_MEM_PRI3 << SCB_SHPR1_R_MEM_BIT)
#define SCB_SHPR1_R_MEM_PRI4    (SCB_SHPR1_MEM_PRI4 << SCB_SHPR1_R_MEM_BIT)
#define SCB_SHPR1_R_MEM_PRI5    (SCB_SHPR1_MEM_PRI5 << SCB_SHPR1_R_MEM_BIT)
#define SCB_SHPR1_R_MEM_PRI6    (SCB_SHPR1_MEM_PRI6 << SCB_SHPR1_R_MEM_BIT)
#define SCB_SHPR1_R_MEM_PRI7    (SCB_SHPR1_MEM_PRI7 << SCB_SHPR1_R_MEM_BIT)
#define SCB_SHPR1_R_MEM_PRI8    (SCB_SHPR1_MEM_PRI8 << SCB_SHPR1_R_MEM_BIT)
#define SCB_SHPR1_R_MEM_PRI9    (SCB_SHPR1_MEM_PRI9 << SCB_SHPR1_R_MEM_BIT)
#define SCB_SHPR1_R_MEM_PRI10    (SCB_SHPR1_MEM_PRI10 << SCB_SHPR1_R_MEM_BIT)
#define SCB_SHPR1_R_MEM_PRI11    (SCB_SHPR1_MEM_PRI11 << SCB_SHPR1_R_MEM_BIT)
#define SCB_SHPR1_R_MEM_PRI12    (SCB_SHPR1_MEM_PRI12 << SCB_SHPR1_R_MEM_BIT)
#define SCB_SHPR1_R_MEM_PRI13    (SCB_SHPR1_MEM_PRI13 << SCB_SHPR1_R_MEM_BIT)
#define SCB_SHPR1_R_MEM_PRI14    (SCB_SHPR1_MEM_PRI14 << SCB_SHPR1_R_MEM_BIT)
#define SCB_SHPR1_R_MEM_PRI15    (SCB_SHPR1_MEM_PRI15 << SCB_SHPR1_R_MEM_BIT)
/*----------*/

/*----------*/
#define SCB_SHPR1_BUS_MASK    ((UBase_t) 0x0000000FUL)
#define SCB_SHPR1_BUS_PRI0    ((UBase_t) 0x00000000UL)
#define SCB_SHPR1_BUS_PRI1    ((UBase_t) 0x00000001UL)
#define SCB_SHPR1_BUS_PRI2    ((UBase_t) 0x00000002UL)
#define SCB_SHPR1_BUS_PRI3    ((UBase_t) 0x00000003UL)
#define SCB_SHPR1_BUS_PRI4    ((UBase_t) 0x00000004UL)
#define SCB_SHPR1_BUS_PRI5    ((UBase_t) 0x00000005UL)
#define SCB_SHPR1_BUS_PRI6    ((UBase_t) 0x00000006UL)
#define SCB_SHPR1_BUS_PRI7    ((UBase_t) 0x00000007UL)
#define SCB_SHPR1_BUS_PRI8    ((UBase_t) 0x00000008UL)
#define SCB_SHPR1_BUS_PRI9    ((UBase_t) 0x00000009UL)
#define SCB_SHPR1_BUS_PRI10    ((UBase_t) 0x000000AUL)
#define SCB_SHPR1_BUS_PRI11    ((UBase_t) 0x0000000BUL)
#define SCB_SHPR1_BUS_PRI12    ((UBase_t) 0x0000000CUL)
#define SCB_SHPR1_BUS_PRI13    ((UBase_t) 0x0000000DUL)
#define SCB_SHPR1_BUS_PRI14    ((UBase_t) 0x0000000EUL)
#define SCB_SHPR1_BUS_PRI15    ((UBase_t) 0x0000000FUL)

#define SCB_SHPR1_R_BUS_BIT    (8UL + 4UL)

