LaloAlvarez-e/ALIENTEK-STM32F767-/STM32F767_DriverLib/xDriver_MCU/Core/SCB/Peripheral/Register/RegisterDefines/SCB_RegisterDefines.h
#define SCB_SHPR1_R_BUS_MASK    (SCB_SHPR1_BUS_MASK << SCB_SHPR1_R_BUS_BIT)
#define SCB_SHPR1_R_BUS_PRI0    (SCB_SHPR1_BUS_PRI0 << SCB_SHPR1_R_BUS_BIT)
#define SCB_SHPR1_R_BUS_PRI1    (SCB_SHPR1_BUS_PRI1 << SCB_SHPR1_R_BUS_BIT)
#define SCB_SHPR1_R_BUS_PRI2    (SCB_SHPR1_BUS_PRI2 << SCB_SHPR1_R_BUS_BIT)
#define SCB_SHPR1_R_BUS_PRI3    (SCB_SHPR1_BUS_PRI3 << SCB_SHPR1_R_BUS_BIT)
#define SCB_SHPR1_R_BUS_PRI4    (SCB_SHPR1_BUS_PRI4 << SCB_SHPR1_R_BUS_BIT)
#define SCB_SHPR1_R_BUS_PRI5    (SCB_SHPR1_BUS_PRI5 << SCB_SHPR1_R_BUS_BIT)
#define SCB_SHPR1_R_BUS_PRI6    (SCB_SHPR1_BUS_PRI6 << SCB_SHPR1_R_BUS_BIT)
#define SCB_SHPR1_R_BUS_PRI7    (SCB_SHPR1_BUS_PRI7 << SCB_SHPR1_R_BUS_BIT)
#define SCB_SHPR1_R_BUS_PRI8    (SCB_SHPR1_BUS_PRI8 << SCB_SHPR1_R_BUS_BIT)
#define SCB_SHPR1_R_BUS_PRI9    (SCB_SHPR1_BUS_PRI9 << SCB_SHPR1_R_BUS_BIT)
#define SCB_SHPR1_R_BUS_PRI10    (SCB_SHPR1_BUS_PRI10 << SCB_SHPR1_R_BUS_BIT)
#define SCB_SHPR1_R_BUS_PRI11    (SCB_SHPR1_BUS_PRI11 << SCB_SHPR1_R_BUS_BIT)
#define SCB_SHPR1_R_BUS_PRI12    (SCB_SHPR1_BUS_PRI12 << SCB_SHPR1_R_BUS_BIT)
#define SCB_SHPR1_R_BUS_PRI13    (SCB_SHPR1_BUS_PRI13 << SCB_SHPR1_R_BUS_BIT)
#define SCB_SHPR1_R_BUS_PRI14    (SCB_SHPR1_BUS_PRI14 << SCB_SHPR1_R_BUS_BIT)
#define SCB_SHPR1_R_BUS_PRI15    (SCB_SHPR1_BUS_PRI15 << SCB_SHPR1_R_BUS_BIT)
/*----------*/

/*----------*/
#define SCB_SHPR1_USAGE_MASK    ((UBase_t) 0x0000000FUL)
#define SCB_SHPR1_USAGE_PRI0    ((UBase_t) 0x00000000UL)
#define SCB_SHPR1_USAGE_PRI1    ((UBase_t) 0x00000001UL)
#define SCB_SHPR1_USAGE_PRI2    ((UBase_t) 0x00000002UL)
#define SCB_SHPR1_USAGE_PRI3    ((UBase_t) 0x00000003UL)
#define SCB_SHPR1_USAGE_PRI4    ((UBase_t) 0x00000004UL)
#define SCB_SHPR1_USAGE_PRI5    ((UBase_t) 0x00000005UL)
#define SCB_SHPR1_USAGE_PRI6    ((UBase_t) 0x00000006UL)
#define SCB_SHPR1_USAGE_PRI7    ((UBase_t) 0x00000007UL)
#define SCB_SHPR1_USAGE_PRI8    ((UBase_t) 0x00000008UL)
#define SCB_SHPR1_USAGE_PRI9    ((UBase_t) 0x00000009UL)
#define SCB_SHPR1_USAGE_PRI10    ((UBase_t) 0x000000AUL)
#define SCB_SHPR1_USAGE_PRI11    ((UBase_t) 0x0000000BUL)
#define SCB_SHPR1_USAGE_PRI12    ((UBase_t) 0x0000000CUL)
#define SCB_SHPR1_USAGE_PRI13    ((UBase_t) 0x0000000DUL)
#define SCB_SHPR1_USAGE_PRI14    ((UBase_t) 0x0000000EUL)
#define SCB_SHPR1_USAGE_PRI15    ((UBase_t) 0x0000000FUL)

#define SCB_SHPR1_R_USAGE_BIT    (16UL + 4UL)

#define SCB_SHPR1_R_USAGE_MASK    (SCB_SHPR1_USAGE_MASK << SCB_SHPR1_R_USAGE_BIT)
#define SCB_SHPR1_R_USAGE_PRI0    (SCB_SHPR1_USAGE_PRI0 << SCB_SHPR1_R_USAGE_BIT)
#define SCB_SHPR1_R_USAGE_PRI1    (SCB_SHPR1_USAGE_PRI1 << SCB_SHPR1_R_USAGE_BIT)
#define SCB_SHPR1_R_USAGE_PRI2    (SCB_SHPR1_USAGE_PRI2 << SCB_SHPR1_R_USAGE_BIT)
#define SCB_SHPR1_R_USAGE_PRI3    (SCB_SHPR1_USAGE_PRI3 << SCB_SHPR1_R_USAGE_BIT)
#define SCB_SHPR1_R_USAGE_PRI4    (SCB_SHPR1_USAGE_PRI4 << SCB_SHPR1_R_USAGE_BIT)
#define SCB_SHPR1_R_USAGE_PRI5    (SCB_SHPR1_USAGE_PRI5 << SCB_SHPR1_R_USAGE_BIT)
#define SCB_SHPR1_R_USAGE_PRI6    (SCB_SHPR1_USAGE_PRI6 << SCB_SHPR1_R_USAGE_BIT)
#define SCB_SHPR1_R_USAGE_PRI7    (SCB_SHPR1_USAGE_PRI7 << SCB_SHPR1_R_USAGE_BIT)
#define SCB_SHPR1_R_USAGE_PRI8    (SCB_SHPR1_USAGE_PRI8 << SCB_SHPR1_R_USAGE_BIT)
#define SCB_SHPR1_R_USAGE_PRI9    (SCB_SHPR1_USAGE_PRI9 << SCB_SHPR1_R_USAGE_BIT)
#define SCB_SHPR1_R_USAGE_PRI10    (SCB_SHPR1_USAGE_PRI10 << SCB_SHPR1_R_USAGE_BIT)
#define SCB_SHPR1_R_USAGE_PRI11    (SCB_SHPR1_USAGE_PRI11 << SCB_SHPR1_R_USAGE_BIT)
#define SCB_SHPR1_R_USAGE_PRI12    (SCB_SHPR1_USAGE_PRI12 << SCB_SHPR1_R_USAGE_BIT)
#define SCB_SHPR1_R_USAGE_PRI13    (SCB_SHPR1_USAGE_PRI13 << SCB_SHPR1_R_USAGE_BIT)
#define SCB_SHPR1_R_USAGE_PRI14    (SCB_SHPR1_USAGE_PRI14 << SCB_SHPR1_R_USAGE_BIT)
#define SCB_SHPR1_R_USAGE_PRI15    (SCB_SHPR1_USAGE_PRI15 << SCB_SHPR1_R_USAGE_BIT)
/*----------*/

/********************************************************************************************/
/************************************* 10 SHPR2 ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_SHPR2_SVCALL_MASK    ((UBase_t) 0x0000000FUL)
#define SCB_SHPR2_SVCALL_PRI0    ((UBase_t) 0x00000000UL)
#define SCB_SHPR2_SVCALL_PRI1    ((UBase_t) 0x00000001UL)
#define SCB_SHPR2_SVCALL_PRI2    ((UBase_t) 0x00000002UL)
#define SCB_SHPR2_SVCALL_PRI3    ((UBase_t) 0x00000003UL)
#define SCB_SHPR2_SVCALL_PRI4    ((UBase_t) 0x00000004UL)
#define SCB_SHPR2_SVCALL_PRI5    ((UBase_t) 0x00000005UL)
#define SCB_SHPR2_SVCALL_PRI6    ((UBase_t) 0x00000006UL)
#define SCB_SHPR2_SVCALL_PRI7    ((UBase_t) 0x00000007UL)
#define SCB_SHPR2_SVCALL_PRI8    ((UBase_t) 0x00000008UL)
#define SCB_SHPR2_SVCALL_PRI9    ((UBase_t) 0x00000009UL)
#define SCB_SHPR2_SVCALL_PRI10    ((UBase_t) 0x000000AUL)
#define SCB_SHPR2_SVCALL_PRI11    ((UBase_t) 0x0000000BUL)
#define SCB_SHPR2_SVCALL_PRI12    ((UBase_t) 0x0000000CUL)
#define SCB_SHPR2_SVCALL_PRI13    ((UBase_t) 0x0000000DUL)
#define SCB_SHPR2_SVCALL_PRI14    ((UBase_t) 0x0000000EUL)
#define SCB_SHPR2_SVCALL_PRI15    ((UBase_t) 0x0000000FUL)

#define SCB_SHPR2_R_SVCALL_BIT    (24UL + 4UL)

#define SCB_SHPR2_R_SVCALL_MASK    (SCB_SHPR2_SVCALL_MASK << SCB_SHPR2_R_SVCALL_BIT)
#define SCB_SHPR2_R_SVCALL_PRI0    (SCB_SHPR2_SVCALL_PRI0 << SCB_SHPR2_R_SVCALL_BIT)
#define SCB_SHPR2_R_SVCALL_PRI1    (SCB_SHPR2_SVCALL_PRI1 << SCB_SHPR2_R_SVCALL_BIT)
#define SCB_SHPR2_R_SVCALL_PRI2    (SCB_SHPR2_SVCALL_PRI2 << SCB_SHPR2_R_SVCALL_BIT)
#define SCB_SHPR2_R_SVCALL_PRI3    (SCB_SHPR2_SVCALL_PRI3 << SCB_SHPR2_R_SVCALL_BIT)
#define SCB_SHPR2_R_SVCALL_PRI4    (SCB_SHPR2_SVCALL_PRI4 << SCB_SHPR2_R_SVCALL_BIT)
#define SCB_SHPR2_R_SVCALL_PRI5    (SCB_SHPR2_SVCALL_PRI5 << SCB_SHPR2_R_SVCALL_BIT)
#define SCB_SHPR2_R_SVCALL_PRI6    (SCB_SHPR2_SVCALL_PRI6 << SCB_SHPR2_R_SVCALL_BIT)
#define SCB_SHPR2_R_SVCALL_PRI7    (SCB_SHPR2_SVCALL_PRI7 << SCB_SHPR2_R_SVCALL_BIT)
#define SCB_SHPR2_R_SVCALL_PRI8    (SCB_SHPR2_SVCALL_PRI8 << SCB_SHPR2_R_SVCALL_BIT)
#define SCB_SHPR2_R_SVCALL_PRI9    (SCB_SHPR2_SVCALL_PRI9 << SCB_SHPR2_R_SVCALL_BIT)
#define SCB_SHPR2_R_SVCALL_PRI10    (SCB_SHPR2_SVCALL_PRI10 << SCB_SHPR2_R_SVCALL_BIT)
#define SCB_SHPR2_R_SVCALL_PRI11    (SCB_SHPR2_SVCALL_PRI11 << SCB_SHPR2_R_SVCALL_BIT)
#define SCB_SHPR2_R_SVCALL_PRI12    (SCB_SHPR2_SVCALL_PRI12 << SCB_SHPR2_R_SVCALL_BIT)
#define SCB_SHPR2_R_SVCALL_PRI13    (SCB_SHPR2_SVCALL_PRI13 << SCB_SHPR2_R_SVCALL_BIT)
#define SCB_SHPR2_R_SVCALL_PRI14    (SCB_SHPR2_SVCALL_PRI14 << SCB_SHPR2_R_SVCALL_BIT)
#define SCB_SHPR2_R_SVCALL_PRI15    (SCB_SHPR2_SVCALL_PRI15 << SCB_SHPR2_R_SVCALL_BIT)
/*----------*/

