LaloAlvarez-e/ALIENTEK-STM32F767-/STM32F767_DriverLib/xDriver_MCU/Core/SCB/Peripheral/Register/RegisterDefines/SCB_RegisterDefines.h
/********************************************************************************************/
/************************************* 11 SHPR3 ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_SHPR3_DEBUG_MASK    ((UBase_t) 0x0000000FUL)
#define SCB_SHPR3_DEBUG_PRI0    ((UBase_t) 0x00000000UL)
#define SCB_SHPR3_DEBUG_PRI1    ((UBase_t) 0x00000001UL)
#define SCB_SHPR3_DEBUG_PRI2    ((UBase_t) 0x00000002UL)
#define SCB_SHPR3_DEBUG_PRI3    ((UBase_t) 0x00000003UL)
#define SCB_SHPR3_DEBUG_PRI4    ((UBase_t) 0x00000004UL)
#define SCB_SHPR3_DEBUG_PRI5    ((UBase_t) 0x00000005UL)
#define SCB_SHPR3_DEBUG_PRI6    ((UBase_t) 0x00000006UL)
#define SCB_SHPR3_DEBUG_PRI7    ((UBase_t) 0x00000007UL)
#define SCB_SHPR3_DEBUG_PRI8    ((UBase_t) 0x00000008UL)
#define SCB_SHPR3_DEBUG_PRI9    ((UBase_t) 0x00000009UL)
#define SCB_SHPR3_DEBUG_PRI10    ((UBase_t) 0x000000AUL)
#define SCB_SHPR3_DEBUG_PRI11    ((UBase_t) 0x0000000BUL)
#define SCB_SHPR3_DEBUG_PRI12    ((UBase_t) 0x0000000CUL)
#define SCB_SHPR3_DEBUG_PRI13    ((UBase_t) 0x0000000DUL)
#define SCB_SHPR3_DEBUG_PRI14    ((UBase_t) 0x0000000EUL)
#define SCB_SHPR3_DEBUG_PRI15    ((UBase_t) 0x0000000FUL)

#define SCB_SHPR3_R_DEBUG_BIT    (0UL + 4UL)

#define SCB_SHPR3_R_DEBUG_MASK    (SCB_SHPR3_DEBUG_MASK << SCB_SHPR3_R_DEBUG_BIT)
#define SCB_SHPR3_R_DEBUG_PRI0    (SCB_SHPR3_DEBUG_PRI0 << SCB_SHPR3_R_DEBUG_BIT)
#define SCB_SHPR3_R_DEBUG_PRI1    (SCB_SHPR3_DEBUG_PRI1 << SCB_SHPR3_R_DEBUG_BIT)
#define SCB_SHPR3_R_DEBUG_PRI2    (SCB_SHPR3_DEBUG_PRI2 << SCB_SHPR3_R_DEBUG_BIT)
#define SCB_SHPR3_R_DEBUG_PRI3    (SCB_SHPR3_DEBUG_PRI3 << SCB_SHPR3_R_DEBUG_BIT)
#define SCB_SHPR3_R_DEBUG_PRI4    (SCB_SHPR3_DEBUG_PRI4 << SCB_SHPR3_R_DEBUG_BIT)
#define SCB_SHPR3_R_DEBUG_PRI5    (SCB_SHPR3_DEBUG_PRI5 << SCB_SHPR3_R_DEBUG_BIT)
#define SCB_SHPR3_R_DEBUG_PRI6    (SCB_SHPR3_DEBUG_PRI6 << SCB_SHPR3_R_DEBUG_BIT)
#define SCB_SHPR3_R_DEBUG_PRI7    (SCB_SHPR3_DEBUG_PRI7 << SCB_SHPR3_R_DEBUG_BIT)
#define SCB_SHPR3_R_DEBUG_PRI8    (SCB_SHPR3_DEBUG_PRI8 << SCB_SHPR3_R_DEBUG_BIT)
#define SCB_SHPR3_R_DEBUG_PRI9    (SCB_SHPR3_DEBUG_PRI9 << SCB_SHPR3_R_DEBUG_BIT)
#define SCB_SHPR3_R_DEBUG_PRI10    (SCB_SHPR3_DEBUG_PRI10 << SCB_SHPR3_R_DEBUG_BIT)
#define SCB_SHPR3_R_DEBUG_PRI11    (SCB_SHPR3_DEBUG_PRI11 << SCB_SHPR3_R_DEBUG_BIT)
#define SCB_SHPR3_R_DEBUG_PRI12    (SCB_SHPR3_DEBUG_PRI12 << SCB_SHPR3_R_DEBUG_BIT)
#define SCB_SHPR3_R_DEBUG_PRI13    (SCB_SHPR3_DEBUG_PRI13 << SCB_SHPR3_R_DEBUG_BIT)
#define SCB_SHPR3_R_DEBUG_PRI14    (SCB_SHPR3_DEBUG_PRI14 << SCB_SHPR3_R_DEBUG_BIT)
#define SCB_SHPR3_R_DEBUG_PRI15    (SCB_SHPR3_DEBUG_PRI15 << SCB_SHPR3_R_DEBUG_BIT)
/*----------*/

/*----------*/
#define SCB_SHPR3_PENDSV_MASK    ((UBase_t) 0x0000000FUL)
#define SCB_SHPR3_PENDSV_PRI0    ((UBase_t) 0x00000000UL)
#define SCB_SHPR3_PENDSV_PRI1    ((UBase_t) 0x00000001UL)
#define SCB_SHPR3_PENDSV_PRI2    ((UBase_t) 0x00000002UL)
#define SCB_SHPR3_PENDSV_PRI3    ((UBase_t) 0x00000003UL)
#define SCB_SHPR3_PENDSV_PRI4    ((UBase_t) 0x00000004UL)
#define SCB_SHPR3_PENDSV_PRI5    ((UBase_t) 0x00000005UL)
#define SCB_SHPR3_PENDSV_PRI6    ((UBase_t) 0x00000006UL)
#define SCB_SHPR3_PENDSV_PRI7    ((UBase_t) 0x00000007UL)
#define SCB_SHPR3_PENDSV_PRI8    ((UBase_t) 0x00000008UL)
#define SCB_SHPR3_PENDSV_PRI9    ((UBase_t) 0x00000009UL)
#define SCB_SHPR3_PENDSV_PRI10    ((UBase_t) 0x000000AUL)
#define SCB_SHPR3_PENDSV_PRI11    ((UBase_t) 0x0000000BUL)
#define SCB_SHPR3_PENDSV_PRI12    ((UBase_t) 0x0000000CUL)
#define SCB_SHPR3_PENDSV_PRI13    ((UBase_t) 0x0000000DUL)
#define SCB_SHPR3_PENDSV_PRI14    ((UBase_t) 0x0000000EUL)
#define SCB_SHPR3_PENDSV_PRI15    ((UBase_t) 0x0000000FUL)

#define SCB_SHPR3_R_PENDSV_BIT    (16UL + 4UL)

#define SCB_SHPR3_R_PENDSV_MASK    (SCB_SHPR3_PENDSV_MASK << SCB_SHPR3_R_PENDSV_BIT)
#define SCB_SHPR3_R_PENDSV_PRI0    (SCB_SHPR3_PENDSV_PRI0 << SCB_SHPR3_R_PENDSV_BIT)
#define SCB_SHPR3_R_PENDSV_PRI1    (SCB_SHPR3_PENDSV_PRI1 << SCB_SHPR3_R_PENDSV_BIT)
#define SCB_SHPR3_R_PENDSV_PRI2    (SCB_SHPR3_PENDSV_PRI2 << SCB_SHPR3_R_PENDSV_BIT)
#define SCB_SHPR3_R_PENDSV_PRI3    (SCB_SHPR3_PENDSV_PRI3 << SCB_SHPR3_R_PENDSV_BIT)
#define SCB_SHPR3_R_PENDSV_PRI4    (SCB_SHPR3_PENDSV_PRI4 << SCB_SHPR3_R_PENDSV_BIT)
#define SCB_SHPR3_R_PENDSV_PRI5    (SCB_SHPR3_PENDSV_PRI5 << SCB_SHPR3_R_PENDSV_BIT)
#define SCB_SHPR3_R_PENDSV_PRI6    (SCB_SHPR3_PENDSV_PRI6 << SCB_SHPR3_R_PENDSV_BIT)
#define SCB_SHPR3_R_PENDSV_PRI7    (SCB_SHPR3_PENDSV_PRI7 << SCB_SHPR3_R_PENDSV_BIT)
#define SCB_SHPR3_R_PENDSV_PRI8    (SCB_SHPR3_PENDSV_PRI8 << SCB_SHPR3_R_PENDSV_BIT)
#define SCB_SHPR3_R_PENDSV_PRI9    (SCB_SHPR3_PENDSV_PRI9 << SCB_SHPR3_R_PENDSV_BIT)
#define SCB_SHPR3_R_PENDSV_PRI10    (SCB_SHPR3_PENDSV_PRI10 << SCB_SHPR3_R_PENDSV_BIT)
#define SCB_SHPR3_R_PENDSV_PRI11    (SCB_SHPR3_PENDSV_PRI11 << SCB_SHPR3_R_PENDSV_BIT)
#define SCB_SHPR3_R_PENDSV_PRI12    (SCB_SHPR3_PENDSV_PRI12 << SCB_SHPR3_R_PENDSV_BIT)
#define SCB_SHPR3_R_PENDSV_PRI13    (SCB_SHPR3_PENDSV_PRI13 << SCB_SHPR3_R_PENDSV_BIT)
#define SCB_SHPR3_R_PENDSV_PRI14    (SCB_SHPR3_PENDSV_PRI14 << SCB_SHPR3_R_PENDSV_BIT)
#define SCB_SHPR3_R_PENDSV_PRI15    (SCB_SHPR3_PENDSV_PRI15 << SCB_SHPR3_R_PENDSV_BIT)
/*----------*/

/*----------*/
#define SCB_SHPR3_SYSTICK_MASK    ((UBase_t) 0x0000000FUL)
#define SCB_SHPR3_SYSTICK_PRI0    ((UBase_t) 0x00000000UL)
#define SCB_SHPR3_SYSTICK_PRI1    ((UBase_t) 0x00000001UL)
#define SCB_SHPR3_SYSTICK_PRI2    ((UBase_t) 0x00000002UL)
#define SCB_SHPR3_SYSTICK_PRI3    ((UBase_t) 0x00000003UL)
#define SCB_SHPR3_SYSTICK_PRI4    ((UBase_t) 0x00000004UL)
#define SCB_SHPR3_SYSTICK_PRI5    ((UBase_t) 0x00000005UL)
#define SCB_SHPR3_SYSTICK_PRI6    ((UBase_t) 0x00000006UL)
#define SCB_SHPR3_SYSTICK_PRI7    ((UBase_t) 0x00000007UL)
#define SCB_SHPR3_SYSTICK_PRI8    ((UBase_t) 0x00000008UL)
#define SCB_SHPR3_SYSTICK_PRI9    ((UBase_t) 0x00000009UL)
#define SCB_SHPR3_SYSTICK_PRI10    ((UBase_t) 0x000000AUL)
#define SCB_SHPR3_SYSTICK_PRI11    ((UBase_t) 0x0000000BUL)
#define SCB_SHPR3_SYSTICK_PRI12    ((UBase_t) 0x0000000CUL)
#define SCB_SHPR3_SYSTICK_PRI13    ((UBase_t) 0x0000000DUL)
#define SCB_SHPR3_SYSTICK_PRI14    ((UBase_t) 0x0000000EUL)
#define SCB_SHPR3_SYSTICK_PRI15    ((UBase_t) 0x0000000FUL)

