LaloAlvarez-e/ALIENTEK-STM32F767-/STM32F767_DriverLib/xDriver_MCU/Core/SCB/Peripheral/Register/RegisterDefines/SCB_RegisterDefines.h
#define SCB_SHPR3_R_SYSTICK_BIT    (24UL + 4UL)

#define SCB_SHPR3_R_SYSTICK_MASK    (SCB_SHPR3_SYSTICK_MASK << SCB_SHPR3_R_SYSTICK_BIT)
#define SCB_SHPR3_R_SYSTICK_PRI0    (SCB_SHPR3_SYSTICK_PRI0 << SCB_SHPR3_R_SYSTICK_BIT)
#define SCB_SHPR3_R_SYSTICK_PRI1    (SCB_SHPR3_SYSTICK_PRI1 << SCB_SHPR3_R_SYSTICK_BIT)
#define SCB_SHPR3_R_SYSTICK_PRI2    (SCB_SHPR3_SYSTICK_PRI2 << SCB_SHPR3_R_SYSTICK_BIT)
#define SCB_SHPR3_R_SYSTICK_PRI3    (SCB_SHPR3_SYSTICK_PRI3 << SCB_SHPR3_R_SYSTICK_BIT)
#define SCB_SHPR3_R_SYSTICK_PRI4    (SCB_SHPR3_SYSTICK_PRI4 << SCB_SHPR3_R_SYSTICK_BIT)
#define SCB_SHPR3_R_SYSTICK_PRI5    (SCB_SHPR3_SYSTICK_PRI5 << SCB_SHPR3_R_SYSTICK_BIT)
#define SCB_SHPR3_R_SYSTICK_PRI6    (SCB_SHPR3_SYSTICK_PRI6 << SCB_SHPR3_R_SYSTICK_BIT)
#define SCB_SHPR3_R_SYSTICK_PRI7    (SCB_SHPR3_SYSTICK_PRI7 << SCB_SHPR3_R_SYSTICK_BIT)
#define SCB_SHPR3_R_SYSTICK_PRI8    (SCB_SHPR3_SYSTICK_PRI8 << SCB_SHPR3_R_SYSTICK_BIT)
#define SCB_SHPR3_R_SYSTICK_PRI9    (SCB_SHPR3_SYSTICK_PRI9 << SCB_SHPR3_R_SYSTICK_BIT)
#define SCB_SHPR3_R_SYSTICK_PRI10    (SCB_SHPR3_SYSTICK_PRI10 << SCB_SHPR3_R_SYSTICK_BIT)
#define SCB_SHPR3_R_SYSTICK_PRI11    (SCB_SHPR3_SYSTICK_PRI11 << SCB_SHPR3_R_SYSTICK_BIT)
#define SCB_SHPR3_R_SYSTICK_PRI12    (SCB_SHPR3_SYSTICK_PRI12 << SCB_SHPR3_R_SYSTICK_BIT)
#define SCB_SHPR3_R_SYSTICK_PRI13    (SCB_SHPR3_SYSTICK_PRI13 << SCB_SHPR3_R_SYSTICK_BIT)
#define SCB_SHPR3_R_SYSTICK_PRI14    (SCB_SHPR3_SYSTICK_PRI14 << SCB_SHPR3_R_SYSTICK_BIT)
#define SCB_SHPR3_R_SYSTICK_PRI15    (SCB_SHPR3_SYSTICK_PRI15 << SCB_SHPR3_R_SYSTICK_BIT)
/*----------*/

/********************************************************************************************/
/************************************* 12 SHCSR ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_SHCSR_MEMFAULTACT_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SHCSR_MEMFAULTACT_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_MEMFAULTACT_ACTIVE    ((UBase_t) 0x00000001UL)

#define SCB_SHCSR_R_MEMFAULTACT_BIT    (0UL)

#define SCB_SHCSR_R_MEMFAULTACT_MASK    (SCB_SHCSR_MEMFAULTACT_MASK << SCB_SHCSR_R_MEMFAULTACT_BIT)
#define SCB_SHCSR_R_MEMFAULTACT_INACTIVE    (SCB_SHCSR_MEMFAULTACT_INACTIVE << SCB_SHCSR_R_MEMFAULTACT_BIT)
#define SCB_SHCSR_R_MEMFAULTACT_ACTIVE    (SCB_SHCSR_MEMFAULTACT_ACTIVE << SCB_SHCSR_R_MEMFAULTACT_BIT)
/*----------*/

/*----------*/
#define SCB_SHCSR_BUSFAULTACT_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SHCSR_BUSFAULTACT_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_BUSFAULTACT_ACTIVE    ((UBase_t) 0x00000001UL)

#define SCB_SHCSR_R_BUSFAULTACT_BIT    (1UL)

#define SCB_SHCSR_R_BUSFAULTACT_MASK    (SCB_SHCSR_BUSFAULTACT_MASK << SCB_SHCSR_R_BUSFAULTACT_BIT)
#define SCB_SHCSR_R_BUSFAULTACT_INACTIVE    (SCB_SHCSR_BUSFAULTACT_INACTIVE << SCB_SHCSR_R_BUSFAULTACT_BIT)
#define SCB_SHCSR_R_BUSFAULTACT_ACTIVE    (SCB_SHCSR_BUSFAULTACT_ACTIVE << SCB_SHCSR_R_BUSFAULTACT_BIT)
/*----------*/

/*----------*/
#define SCB_SHCSR_USGFAULTACT_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SHCSR_USGFAULTACT_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_USGFAULTACT_ACTIVE    ((UBase_t) 0x00000001UL)

#define SCB_SHCSR_R_USGFAULTACT_BIT    (3UL)

#define SCB_SHCSR_R_USGFAULTACT_MASK    (SCB_SHCSR_USGFAULTACT_MASK << SCB_SHCSR_R_USGFAULTACT_BIT)
#define SCB_SHCSR_R_USGFAULTACT_INACTIVE    (SCB_SHCSR_USGFAULTACT_INACTIVE << SCB_SHCSR_R_USGFAULTACT_BIT)
#define SCB_SHCSR_R_USGFAULTACT_ACTIVE    (SCB_SHCSR_USGFAULTACT_ACTIVE << SCB_SHCSR_R_USGFAULTACT_BIT)
/*----------*/

/*----------*/
#define SCB_SHCSR_SVCALLACT_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SHCSR_SVCALLACT_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_SVCALLACT_ACTIVE    ((UBase_t) 0x00000001UL)

#define SCB_SHCSR_R_SVCALLACT_BIT    (7UL)

#define SCB_SHCSR_R_SVCALLACT_MASK    (SCB_SHCSR_SVCALLACT_MASK << SCB_SHCSR_R_SVCALLACT_BIT)
#define SCB_SHCSR_R_SVCALLACT_INACTIVE    (SCB_SHCSR_SVCALLACT_INACTIVE << SCB_SHCSR_R_SVCALLACT_BIT)
#define SCB_SHCSR_R_SVCALLACT_ACTIVE    (SCB_SHCSR_SVCALLACT_ACTIVE << SCB_SHCSR_R_SVCALLACT_BIT)
/*----------*/

/*----------*/
#define SCB_SHCSR_MONITORACT_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SHCSR_MONITORACT_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_MONITORACT_ACTIVE    ((UBase_t) 0x00000001UL)

#define SCB_SHCSR_R_MONITORACT_BIT    (8UL)

#define SCB_SHCSR_R_MONITORACT_MASK    (SCB_SHCSR_MONITORACT_MASK << SCB_SHCSR_R_MONITORACT_BIT)
#define SCB_SHCSR_R_MONITORACT_INACTIVE    (SCB_SHCSR_MONITORACT_INACTIVE << SCB_SHCSR_R_MONITORACT_BIT)
#define SCB_SHCSR_R_MONITORACT_ACTIVE    (SCB_SHCSR_MONITORACT_ACTIVE << SCB_SHCSR_R_MONITORACT_BIT)
/*----------*/

/*----------*/
#define SCB_SHCSR_PENDSVACT_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SHCSR_PENDSVACT_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_PENDSVACT_ACTIVE    ((UBase_t) 0x00000001UL)

#define SCB_SHCSR_R_PENDSVACT_BIT    (10UL)

#define SCB_SHCSR_R_PENDSVACT_MASK    (SCB_SHCSR_PENDSVACT_MASK << SCB_SHCSR_R_PENDSVACT_BIT)
#define SCB_SHCSR_R_PENDSVACT_INACTIVE    (SCB_SHCSR_PENDSVACT_INACTIVE << SCB_SHCSR_R_PENDSVACT_BIT)
#define SCB_SHCSR_R_PENDSVACT_ACTIVE    (SCB_SHCSR_PENDSVACT_ACTIVE << SCB_SHCSR_R_PENDSVACT_BIT)
/*----------*/

/*----------*/
#define SCB_SHCSR_SYSTICKACT_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SHCSR_SYSTICKACT_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_SYSTICKACT_ACTIVE    ((UBase_t) 0x00000001UL)

#define SCB_SHCSR_R_SYSTICKACT_BIT    (11UL)

#define SCB_SHCSR_R_SYSTICKACT_MASK    (SCB_SHCSR_SYSTICKACT_MASK << SCB_SHCSR_R_SYSTICKACT_BIT)
#define SCB_SHCSR_R_SYSTICKACT_INACTIVE    (SCB_SHCSR_SYSTICKACT_INACTIVE << SCB_SHCSR_R_SYSTICKACT_BIT)
#define SCB_SHCSR_R_SYSTICKACT_ACTIVE    (SCB_SHCSR_SYSTICKACT_ACTIVE << SCB_SHCSR_R_SYSTICKACT_BIT)
/*----------*/

/*----------*/
#define SCB_SHCSR_USGFAULTPENDED_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SHCSR_USGFAULTPENDED_UNPENDED    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_USGFAULTPENDED_PENDED    ((UBase_t) 0x00000001UL)

