LaloAlvarez-e/ALIENTEK-STM32F767-/STM32F767_DriverLib/xDriver_MCU/Core/SCB/Peripheral/Register/RegisterDefines/SCB_RegisterDefines.h
#define SCB_SHCSR_R_USGFAULTPENDED_BIT    (12UL)

#define SCB_SHCSR_R_USGFAULTPENDED_MASK    (SCB_SHCSR_USGFAULTPENDED_MASK << SCB_SHCSR_R_USGFAULTPENDED_BIT)
#define SCB_SHCSR_R_USGFAULTPENDED_UNPENDED    (SCB_SHCSR_USGFAULTPENDED_UNPENDED << SCB_SHCSR_R_USGFAULTPENDED_BIT)
#define SCB_SHCSR_R_USGFAULTPENDED_PENDED    (SCB_SHCSR_USGFAULTPENDED_PENDED << SCB_SHCSR_R_USGFAULTPENDED_BIT)
/*----------*/

/*----------*/
#define SCB_SHCSR_MEMFAULTPENDED_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SHCSR_MEMFAULTPENDED_UNPENDED    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_MEMFAULTPENDED_PENDED    ((UBase_t) 0x00000001UL)

#define SCB_SHCSR_R_MEMFAULTPENDED_BIT    (13UL)

#define SCB_SHCSR_R_MEMFAULTPENDED_MASK    (SCB_SHCSR_MEMFAULTPENDED_MASK << SCB_SHCSR_R_MEMFAULTPENDED_BIT)
#define SCB_SHCSR_R_MEMFAULTPENDED_UNPENDED    (SCB_SHCSR_MEMFAULTPENDED_UNPENDED << SCB_SHCSR_R_MEMFAULTPENDED_BIT)
#define SCB_SHCSR_R_MEMFAULTPENDED_PENDED    (SCB_SHCSR_MEMFAULTPENDED_PENDED << SCB_SHCSR_R_MEMFAULTPENDED_BIT)
/*----------*/

/*----------*/
#define SCB_SHCSR_BUSFAULTPENDED_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SHCSR_BUSFAULTPENDED_UNPENDED    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_BUSFAULTPENDED_PENDED    ((UBase_t) 0x00000001UL)

#define SCB_SHCSR_R_BUSFAULTPENDED_BIT    (14UL)

#define SCB_SHCSR_R_BUSFAULTPENDED_MASK    (SCB_SHCSR_BUSFAULTPENDED_MASK << SCB_SHCSR_R_BUSFAULTPENDED_BIT)
#define SCB_SHCSR_R_BUSFAULTPENDED_UNPENDED    (SCB_SHCSR_BUSFAULTPENDED_UNPENDED << SCB_SHCSR_R_BUSFAULTPENDED_BIT)
#define SCB_SHCSR_R_BUSFAULTPENDED_PENDED    (SCB_SHCSR_BUSFAULTPENDED_PENDED << SCB_SHCSR_R_BUSFAULTPENDED_BIT)
/*----------*/

/*----------*/
#define SCB_SHCSR_SVCALLPENDED_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SHCSR_SVCALLPENDED_UNPENDED    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_SVCALLPENDED_PENDED    ((UBase_t) 0x00000001UL)

#define SCB_SHCSR_R_SVCALLPENDED_BIT    (15UL)

#define SCB_SHCSR_R_SVCALLPENDED_MASK    (SCB_SHCSR_SVCALLPENDED_MASK << SCB_SHCSR_R_SVCALLPENDED_BIT)
#define SCB_SHCSR_R_SVCALLPENDED_UNPENDED    (SCB_SHCSR_SVCALLPENDED_UNPENDED << SCB_SHCSR_R_SVCALLPENDED_BIT)
#define SCB_SHCSR_R_SVCALLPENDED_PENDED    (SCB_SHCSR_SVCALLPENDED_PENDED << SCB_SHCSR_R_SVCALLPENDED_BIT)
/*----------*/

/*----------*/
#define SCB_SHCSR_MEMFAULTENA_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SHCSR_MEMFAULTENA_DIS    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_MEMFAULTENA_ENA    ((UBase_t) 0x00000001UL)

#define SCB_SHCSR_R_MEMFAULTENA_BIT    (16UL)

#define SCB_SHCSR_R_MEMFAULTENA_MASK    (SCB_SHCSR_MEMFAULTENA_MASK << SCB_SHCSR_R_MEMFAULTENA_BIT)
#define SCB_SHCSR_R_MEMFAULTENA_DIS    (SCB_SHCSR_MEMFAULTENA_DIS << SCB_SHCSR_R_MEMFAULTENA_BIT)
#define SCB_SHCSR_R_MEMFAULTENA_ENA    (SCB_SHCSR_MEMFAULTENA_ENA << SCB_SHCSR_R_MEMFAULTENA_BIT)
/*----------*/

/*----------*/
#define SCB_SHCSR_BUSFAULTENA_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SHCSR_BUSFAULTENA_DIS    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_BUSFAULTENA_ENA    ((UBase_t) 0x00000001UL)

#define SCB_SHCSR_R_BUSFAULTENA_BIT    (17UL)

#define SCB_SHCSR_R_BUSFAULTENA_MASK    (SCB_SHCSR_BUSFAULTENA_MASK << SCB_SHCSR_R_BUSFAULTENA_BIT)
#define SCB_SHCSR_R_BUSFAULTENA_DIS    (SCB_SHCSR_BUSFAULTENA_DIS << SCB_SHCSR_R_BUSFAULTENA_BIT)
#define SCB_SHCSR_R_BUSFAULTENA_ENA    (SCB_SHCSR_BUSFAULTENA_ENA << SCB_SHCSR_R_BUSFAULTENA_BIT)
/*----------*/

/*----------*/
#define SCB_SHCSR_USGFAULTENA_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SHCSR_USGFAULTENA_DIS    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_USGFAULTENA_ENA    ((UBase_t) 0x00000001UL)

#define SCB_SHCSR_R_USGFAULTENA_BIT    (18UL)

#define SCB_SHCSR_R_USGFAULTENA_MASK    (SCB_SHCSR_USGFAULTENA_MASK << SCB_SHCSR_R_USGFAULTENA_BIT)
#define SCB_SHCSR_R_USGFAULTENA_DIS    (SCB_SHCSR_USGFAULTENA_DIS << SCB_SHCSR_R_USGFAULTENA_BIT)
#define SCB_SHCSR_R_USGFAULTENA_ENA    (SCB_SHCSR_USGFAULTENA_ENA << SCB_SHCSR_R_USGFAULTENA_BIT)
/*----------*/

/********************************************************************************************/
/************************************* 13 CFSR ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_CFSR_IACCVIOL_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_IACCVIOL_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_IACCVIOL_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_IACCVIOL_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_CFSR_R_IACCVIOL_BIT    (0UL)

#define SCB_CFSR_R_IACCVIOL_MASK    (SCB_CFSR_IACCVIOL_MASK << SCB_CFSR_R_IACCVIOL_BIT)
#define SCB_CFSR_R_IACCVIOL_INACTIVE    (SCB_CFSR_IACCVIOL_INACTIVE << SCB_CFSR_R_IACCVIOL_BIT)
#define SCB_CFSR_R_IACCVIOL_ACTIVE    (SCB_CFSR_IACCVIOL_ACTIVE << SCB_CFSR_R_IACCVIOL_BIT)
#define SCB_CFSR_R_IACCVIOL_CLEAR    (SCB_CFSR_IACCVIOL_CLEAR << SCB_CFSR_R_IACCVIOL_BIT)
/*----------*/

/*----------*/
#define SCB_CFSR_DACCVIOL_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_DACCVIOL_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_DACCVIOL_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_DACCVIOL_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_CFSR_R_DACCVIOL_BIT    (1UL)

#define SCB_CFSR_R_DACCVIOL_MASK    (SCB_CFSR_DACCVIOL_MASK << SCB_CFSR_R_DACCVIOL_BIT)
#define SCB_CFSR_R_DACCVIOL_INACTIVE    (SCB_CFSR_DACCVIOL_INACTIVE << SCB_CFSR_R_DACCVIOL_BIT)
#define SCB_CFSR_R_DACCVIOL_ACTIVE    (SCB_CFSR_DACCVIOL_ACTIVE << SCB_CFSR_R_DACCVIOL_BIT)
#define SCB_CFSR_R_DACCVIOL_CLEAR    (SCB_CFSR_DACCVIOL_CLEAR << SCB_CFSR_R_DACCVIOL_BIT)
/*----------*/

/*----------*/
#define SCB_CFSR_MUNSTKERR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_MUNSTKERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_MUNSTKERR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_MUNSTKERR_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_CFSR_R_MUNSTKERR_BIT    (3UL)

#define SCB_CFSR_R_MUNSTKERR_MASK    (SCB_CFSR_MUNSTKERR_MASK << SCB_CFSR_R_MUNSTKERR_BIT)
#define SCB_CFSR_R_MUNSTKERR_INACTIVE    (SCB_CFSR_MUNSTKERR_INACTIVE << SCB_CFSR_R_MUNSTKERR_BIT)
#define SCB_CFSR_R_MUNSTKERR_ACTIVE    (SCB_CFSR_MUNSTKERR_ACTIVE << SCB_CFSR_R_MUNSTKERR_BIT)
#define SCB_CFSR_R_MUNSTKERR_CLEAR    (SCB_CFSR_MUNSTKERR_CLEAR << SCB_CFSR_R_MUNSTKERR_BIT)
/*----------*/

/*----------*/
#define SCB_CFSR_MSTKERR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_MSTKERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_MSTKERR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_MSTKERR_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_CFSR_R_MSTKERR_BIT    (4UL)

#define SCB_CFSR_R_MSTKERR_MASK    (SCB_CFSR_MSTKERR_MASK << SCB_CFSR_R_MSTKERR_BIT)
#define SCB_CFSR_R_MSTKERR_INACTIVE    (SCB_CFSR_MSTKERR_INACTIVE << SCB_CFSR_R_MSTKERR_BIT)
#define SCB_CFSR_R_MSTKERR_ACTIVE    (SCB_CFSR_MSTKERR_ACTIVE << SCB_CFSR_R_MSTKERR_BIT)
#define SCB_CFSR_R_MSTKERR_CLEAR    (SCB_CFSR_MSTKERR_CLEAR << SCB_CFSR_R_MSTKERR_BIT)
/*----------*/

/*----------*/
#define SCB_CFSR_MLSPERR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_MLSPERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_MLSPERR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_MLSPERR_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_CFSR_R_MLSPERR_BIT    (5UL)

#define SCB_CFSR_R_MLSPERR_MASK    (SCB_CFSR_MLSPERR_MASK << SCB_CFSR_R_MLSPERR_BIT)
#define SCB_CFSR_R_MLSPERR_INACTIVE    (SCB_CFSR_MLSPERR_INACTIVE << SCB_CFSR_R_MLSPERR_BIT)
#define SCB_CFSR_R_MLSPERR_ACTIVE    (SCB_CFSR_MLSPERR_ACTIVE << SCB_CFSR_R_MLSPERR_BIT)
#define SCB_CFSR_R_MLSPERR_CLEAR    (SCB_CFSR_MLSPERR_CLEAR << SCB_CFSR_R_MLSPERR_BIT)
/*----------*/

/*----------*/
#define SCB_CFSR_MMARVALID_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_MMARVALID_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_MMARVALID_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_MMARVALID_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_CFSR_R_MMARVALID_BIT    (7UL)

#define SCB_CFSR_R_MMARVALID_MASK    (SCB_CFSR_MMARVALID_MASK << SCB_CFSR_R_MMARVALID_BIT)
#define SCB_CFSR_R_MMARVALID_INACTIVE    (SCB_CFSR_MMARVALID_INACTIVE << SCB_CFSR_R_MMARVALID_BIT)
#define SCB_CFSR_R_MMARVALID_ACTIVE    (SCB_CFSR_MMARVALID_ACTIVE << SCB_CFSR_R_MMARVALID_BIT)
#define SCB_CFSR_R_MMARVALID_CLEAR    (SCB_CFSR_MMARVALID_CLEAR << SCB_CFSR_R_MMARVALID_BIT)
/*----------*/




/*----------*/
#define SCB_CFSR_IBUSERR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_IBUSERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_IBUSERR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_IBUSERR_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_CFSR_R_IBUSERR_BIT    (8UL)

#define SCB_CFSR_R_IBUSERR_MASK    (SCB_CFSR_IBUSERR_MASK << SCB_CFSR_R_IBUSERR_BIT)
#define SCB_CFSR_R_IBUSERR_INACTIVE    (SCB_CFSR_IBUSERR_INACTIVE << SCB_CFSR_R_IBUSERR_BIT)
#define SCB_CFSR_R_IBUSERR_ACTIVE    (SCB_CFSR_IBUSERR_ACTIVE << SCB_CFSR_R_IBUSERR_BIT)
#define SCB_CFSR_R_IBUSERR_CLEAR    (SCB_CFSR_IBUSERR_CLEAR << SCB_CFSR_R_IBUSERR_BIT)
/*----------*/

/*----------*/
#define SCB_CFSR_PRECISERR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_PRECISERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_PRECISERR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_PRECISERR_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_CFSR_R_PRECISERR_BIT    (9UL)

