LaloAlvarez-e/ALIENTEK-STM32F767-/STM32F767_DriverLib/xDriver_MCU/Core/SCB/Peripheral/Register/RegisterDefines/SCB_RegisterDefines.h
#define SCB_CFSR_R_PRECISERR_MASK    (SCB_CFSR_PRECISERR_MASK << SCB_CFSR_R_PRECISERR_BIT)
#define SCB_CFSR_R_PRECISERR_INACTIVE    (SCB_CFSR_PRECISERR_INACTIVE << SCB_CFSR_R_PRECISERR_BIT)
#define SCB_CFSR_R_PRECISERR_ACTIVE    (SCB_CFSR_PRECISERR_ACTIVE << SCB_CFSR_R_PRECISERR_BIT)
#define SCB_CFSR_R_PRECISERR_CLEAR    (SCB_CFSR_PRECISERR_CLEAR << SCB_CFSR_R_PRECISERR_BIT)
/*----------*/

/*----------*/
#define SCB_CFSR_IMPRECISERR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_IMPRECISERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_IMPRECISERR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_IMPRECISERR_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_CFSR_R_IMPRECISERR_BIT    (10UL)

#define SCB_CFSR_R_IMPRECISERR_MASK    (SCB_CFSR_IMPRECISERR_MASK << SCB_CFSR_R_IMPRECISERR_BIT)
#define SCB_CFSR_R_IMPRECISERR_INACTIVE    (SCB_CFSR_IMPRECISERR_INACTIVE << SCB_CFSR_R_IMPRECISERR_BIT)
#define SCB_CFSR_R_IMPRECISERR_ACTIVE    (SCB_CFSR_IMPRECISERR_ACTIVE << SCB_CFSR_R_IMPRECISERR_BIT)
#define SCB_CFSR_R_IMPRECISERR_CLEAR    (SCB_CFSR_IMPRECISERR_CLEAR << SCB_CFSR_R_IMPRECISERR_BIT)
/*----------*/

/*----------*/
#define SCB_CFSR_UNSTKERR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_UNSTKERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_UNSTKERR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_UNSTKERR_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_CFSR_R_UNSTKERR_BIT    (11UL)

#define SCB_CFSR_R_UNSTKERR_MASK    (SCB_CFSR_UNSTKERR_MASK << SCB_CFSR_R_UNSTKERR_BIT)
#define SCB_CFSR_R_UNSTKERR_INACTIVE    (SCB_CFSR_UNSTKERR_INACTIVE << SCB_CFSR_R_UNSTKERR_BIT)
#define SCB_CFSR_R_UNSTKERR_ACTIVE    (SCB_CFSR_UNSTKERR_ACTIVE << SCB_CFSR_R_UNSTKERR_BIT)
#define SCB_CFSR_R_UNSTKERR_CLEAR    (SCB_CFSR_UNSTKERR_CLEAR << SCB_CFSR_R_UNSTKERR_BIT)
/*----------*/

/*----------*/
#define SCB_CFSR_STKERR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_STKERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_STKERR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_STKERR_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_CFSR_R_STKERR_BIT    (12UL)

#define SCB_CFSR_R_STKERR_MASK    (SCB_CFSR_STKERR_MASK << SCB_CFSR_R_STKERR_BIT)
#define SCB_CFSR_R_STKERR_INACTIVE    (SCB_CFSR_STKERR_INACTIVE << SCB_CFSR_R_STKERR_BIT)
#define SCB_CFSR_R_STKERR_ACTIVE    (SCB_CFSR_STKERR_ACTIVE << SCB_CFSR_R_STKERR_BIT)
#define SCB_CFSR_R_STKERR_CLEAR    (SCB_CFSR_STKERR_CLEAR << SCB_CFSR_R_STKERR_BIT)
/*----------*/

/*----------*/
#define SCB_CFSR_LSPERR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_LSPERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_LSPERR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_LSPERR_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_CFSR_R_LSPERR_BIT    (13UL)

#define SCB_CFSR_R_LSPERR_MASK    (SCB_CFSR_LSPERR_MASK << SCB_CFSR_R_LSPERR_BIT)
#define SCB_CFSR_R_LSPERR_INACTIVE    (SCB_CFSR_LSPERR_INACTIVE << SCB_CFSR_R_LSPERR_BIT)
#define SCB_CFSR_R_LSPERR_ACTIVE    (SCB_CFSR_LSPERR_ACTIVE << SCB_CFSR_R_LSPERR_BIT)
#define SCB_CFSR_R_LSPERR_CLEAR    (SCB_CFSR_LSPERR_CLEAR << SCB_CFSR_R_LSPERR_BIT)
/*----------*/

/*----------*/
#define SCB_CFSR_BFARVALID_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_BFARVALID_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_BFARVALID_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_BFARVALID_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_CFSR_R_BFARVALID_BIT    (15UL)

#define SCB_CFSR_R_BFARVALID_MASK    (SCB_CFSR_BFARVALID_MASK << SCB_CFSR_R_BFARVALID_BIT)
#define SCB_CFSR_R_BFARVALID_INACTIVE    (SCB_CFSR_BFARVALID_INACTIVE << SCB_CFSR_R_BFARVALID_BIT)
#define SCB_CFSR_R_BFARVALID_ACTIVE    (SCB_CFSR_BFARVALID_ACTIVE << SCB_CFSR_R_BFARVALID_BIT)
#define SCB_CFSR_R_BFARVALID_CLEAR    (SCB_CFSR_BFARVALID_CLEAR << SCB_CFSR_R_BFARVALID_BIT)
/*----------*/








/*----------*/
#define SCB_CFSR_UNDEFINSTR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_UNDEFINSTR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_UNDEFINSTR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_UNDEFINSTR_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_CFSR_R_UNDEFINSTR_BIT    (16UL)

#define SCB_CFSR_R_UNDEFINSTR_MASK    (SCB_CFSR_UNDEFINSTR_MASK << SCB_CFSR_R_UNDEFINSTR_BIT)
#define SCB_CFSR_R_UNDEFINSTR_INACTIVE    (SCB_CFSR_UNDEFINSTR_INACTIVE << SCB_CFSR_R_UNDEFINSTR_BIT)
#define SCB_CFSR_R_UNDEFINSTR_ACTIVE    (SCB_CFSR_UNDEFINSTR_ACTIVE << SCB_CFSR_R_UNDEFINSTR_BIT)
#define SCB_CFSR_R_UNDEFINSTR_CLEAR    (SCB_CFSR_UNDEFINSTR_CLEAR << SCB_CFSR_R_UNDEFINSTR_BIT)
/*----------*/

/*----------*/
#define SCB_CFSR_INVSTATE_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_INVSTATE_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_INVSTATE_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_INVSTATE_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_CFSR_R_INVSTATE_BIT    (17UL)

#define SCB_CFSR_R_INVSTATE_MASK    (SCB_CFSR_INVSTATE_MASK << SCB_CFSR_R_INVSTATE_BIT)
#define SCB_CFSR_R_INVSTATE_INACTIVE    (SCB_CFSR_INVSTATE_INACTIVE << SCB_CFSR_R_INVSTATE_BIT)
#define SCB_CFSR_R_INVSTATE_ACTIVE    (SCB_CFSR_INVSTATE_ACTIVE << SCB_CFSR_R_INVSTATE_BIT)
#define SCB_CFSR_R_INVSTATE_CLEAR    (SCB_CFSR_INVSTATE_CLEAR << SCB_CFSR_R_INVSTATE_BIT)
/*----------*/

/*----------*/
#define SCB_CFSR_INVPC_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_INVPC_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_INVPC_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_INVPC_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_CFSR_R_INVPC_BIT    (18UL)

#define SCB_CFSR_R_INVPC_MASK    (SCB_CFSR_INVPC_MASK << SCB_CFSR_R_INVPC_BIT)
#define SCB_CFSR_R_INVPC_INACTIVE    (SCB_CFSR_INVPC_INACTIVE << SCB_CFSR_R_INVPC_BIT)
#define SCB_CFSR_R_INVPC_ACTIVE    (SCB_CFSR_INVPC_ACTIVE << SCB_CFSR_R_INVPC_BIT)
#define SCB_CFSR_R_INVPC_CLEAR    (SCB_CFSR_INVPC_CLEAR << SCB_CFSR_R_INVPC_BIT)
/*----------*/

/*----------*/
#define SCB_CFSR_NOCP_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_NOCP_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_NOCP_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_NOCP_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_CFSR_R_NOCP_BIT    (19UL)

