LaloAlvarez-e/ALIENTEK-STM32F767-/STM32F767_DriverLib/xDriver_MCU/Core/SCB/Peripheral/Register/RegisterDefines/SCB_RegisterDefines.h
#define SCB_CFSR_R_NOCP_MASK    (SCB_CFSR_NOCP_MASK << SCB_CFSR_R_NOCP_BIT)
#define SCB_CFSR_R_NOCP_INACTIVE    (SCB_CFSR_NOCP_INACTIVE << SCB_CFSR_R_NOCP_BIT)
#define SCB_CFSR_R_NOCP_ACTIVE    (SCB_CFSR_NOCP_ACTIVE << SCB_CFSR_R_NOCP_BIT)
#define SCB_CFSR_R_NOCP_CLEAR    (SCB_CFSR_NOCP_CLEAR << SCB_CFSR_R_NOCP_BIT)
/*----------*/

/*----------*/
#define SCB_CFSR_UNALIGNED_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_UNALIGNED_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_UNALIGNED_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_UNALIGNED_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_CFSR_R_UNALIGNED_BIT    (24UL)

#define SCB_CFSR_R_UNALIGNED_MASK    (SCB_CFSR_UNALIGNED_MASK << SCB_CFSR_R_UNALIGNED_BIT)
#define SCB_CFSR_R_UNALIGNED_INACTIVE    (SCB_CFSR_UNALIGNED_INACTIVE << SCB_CFSR_R_UNALIGNED_BIT)
#define SCB_CFSR_R_UNALIGNED_ACTIVE    (SCB_CFSR_UNALIGNED_ACTIVE << SCB_CFSR_R_UNALIGNED_BIT)
#define SCB_CFSR_R_UNALIGNED_CLEAR    (SCB_CFSR_UNALIGNED_CLEAR << SCB_CFSR_R_UNALIGNED_BIT)
/*----------*/

/*----------*/
#define SCB_CFSR_DIVBYZERO_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_DIVBYZERO_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_DIVBYZERO_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_DIVBYZERO_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_CFSR_R_DIVBYZERO_BIT    (25UL)

#define SCB_CFSR_R_DIVBYZERO_MASK    (SCB_CFSR_DIVBYZERO_MASK << SCB_CFSR_R_DIVBYZERO_BIT)
#define SCB_CFSR_R_DIVBYZERO_INACTIVE    (SCB_CFSR_DIVBYZERO_INACTIVE << SCB_CFSR_R_DIVBYZERO_BIT)
#define SCB_CFSR_R_DIVBYZERO_ACTIVE    (SCB_CFSR_DIVBYZERO_ACTIVE << SCB_CFSR_R_DIVBYZERO_BIT)
#define SCB_CFSR_R_DIVBYZERO_CLEAR    (SCB_CFSR_DIVBYZERO_CLEAR << SCB_CFSR_R_DIVBYZERO_BIT)
/*----------*/

/********************************************************************************************/
/************************************* 13_1 UCFSR ***********************************************/
/********************************************************************************************/

/*----------*/
#define SCB_UCFSR_UNDEFINSTR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_UCFSR_UNDEFINSTR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_UCFSR_UNDEFINSTR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_UCFSR_UNDEFINSTR_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_UCFSR_R_UNDEFINSTR_BIT    (0UL)

#define SCB_UCFSR_R_UNDEFINSTR_MASK    (SCB_UCFSR_UNDEFINSTR_MASK << SCB_UCFSR_R_UNDEFINSTR_BIT)
#define SCB_UCFSR_R_UNDEFINSTR_INACTIVE    (SCB_UCFSR_UNDEFINSTR_INACTIVE << SCB_UCFSR_R_UNDEFINSTR_BIT)
#define SCB_UCFSR_R_UNDEFINSTR_ACTIVE    (SCB_UCFSR_UNDEFINSTR_ACTIVE << SCB_UCFSR_R_UNDEFINSTR_BIT)
#define SCB_UCFSR_R_UNDEFINSTR_CLEAR    (SCB_UCFSR_UNDEFINSTR_CLEAR << SCB_UCFSR_R_UNDEFINSTR_BIT)
/*----------*/

/*----------*/
#define SCB_UCFSR_INVSTATE_MASK    ((UBase_t) 0x00000001UL)
#define SCB_UCFSR_INVSTATE_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_UCFSR_INVSTATE_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_UCFSR_INVSTATE_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_UCFSR_R_INVSTATE_BIT    (1UL)

#define SCB_UCFSR_R_INVSTATE_MASK    (SCB_UCFSR_INVSTATE_MASK << SCB_UCFSR_R_INVSTATE_BIT)
#define SCB_UCFSR_R_INVSTATE_INACTIVE    (SCB_UCFSR_INVSTATE_INACTIVE << SCB_UCFSR_R_INVSTATE_BIT)
#define SCB_UCFSR_R_INVSTATE_ACTIVE    (SCB_UCFSR_INVSTATE_ACTIVE << SCB_UCFSR_R_INVSTATE_BIT)
#define SCB_UCFSR_R_INVSTATE_CLEAR    (SCB_UCFSR_INVSTATE_CLEAR << SCB_UCFSR_R_INVSTATE_BIT)
/*----------*/

/*----------*/
#define SCB_UCFSR_INVPC_MASK    ((UBase_t) 0x00000001UL)
#define SCB_UCFSR_INVPC_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_UCFSR_INVPC_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_UCFSR_INVPC_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_UCFSR_R_INVPC_BIT    (2UL)

#define SCB_UCFSR_R_INVPC_MASK    (SCB_UCFSR_INVPC_MASK << SCB_UCFSR_R_INVPC_BIT)
#define SCB_UCFSR_R_INVPC_INACTIVE    (SCB_UCFSR_INVPC_INACTIVE << SCB_UCFSR_R_INVPC_BIT)
#define SCB_UCFSR_R_INVPC_ACTIVE    (SCB_UCFSR_INVPC_ACTIVE << SCB_UCFSR_R_INVPC_BIT)
#define SCB_UCFSR_R_INVPC_CLEAR    (SCB_UCFSR_INVPC_CLEAR << SCB_UCFSR_R_INVPC_BIT)
/*----------*/

/*----------*/
#define SCB_UCFSR_NOCP_MASK    ((UBase_t) 0x00000001UL)
#define SCB_UCFSR_NOCP_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_UCFSR_NOCP_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_UCFSR_NOCP_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_UCFSR_R_NOCP_BIT    (3UL)

#define SCB_UCFSR_R_NOCP_MASK    (SCB_UCFSR_NOCP_MASK << SCB_UCFSR_R_NOCP_BIT)
#define SCB_UCFSR_R_NOCP_INACTIVE    (SCB_UCFSR_NOCP_INACTIVE << SCB_UCFSR_R_NOCP_BIT)
#define SCB_UCFSR_R_NOCP_ACTIVE    (SCB_UCFSR_NOCP_ACTIVE << SCB_UCFSR_R_NOCP_BIT)
#define SCB_UCFSR_R_NOCP_CLEAR    (SCB_UCFSR_NOCP_CLEAR << SCB_UCFSR_R_NOCP_BIT)
/*----------*/

/*----------*/
#define SCB_UCFSR_UNALIGNED_MASK    ((UBase_t) 0x00000001UL)
#define SCB_UCFSR_UNALIGNED_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_UCFSR_UNALIGNED_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_UCFSR_UNALIGNED_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_UCFSR_R_UNALIGNED_BIT    (8UL)

#define SCB_UCFSR_R_UNALIGNED_MASK    (SCB_UCFSR_UNALIGNED_MASK << SCB_UCFSR_R_UNALIGNED_BIT)
#define SCB_UCFSR_R_UNALIGNED_INACTIVE    (SCB_UCFSR_UNALIGNED_INACTIVE << SCB_UCFSR_R_UNALIGNED_BIT)
#define SCB_UCFSR_R_UNALIGNED_ACTIVE    (SCB_UCFSR_UNALIGNED_ACTIVE << SCB_UCFSR_R_UNALIGNED_BIT)
#define SCB_UCFSR_R_UNALIGNED_CLEAR    (SCB_UCFSR_UNALIGNED_CLEAR << SCB_UCFSR_R_UNALIGNED_BIT)
/*----------*/

/*----------*/
#define SCB_UCFSR_DIVBYZERO_MASK    ((UBase_t) 0x00000001UL)
#define SCB_UCFSR_DIVBYZERO_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_UCFSR_DIVBYZERO_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_UCFSR_DIVBYZERO_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_UCFSR_R_DIVBYZERO_BIT    (9UL)

#define SCB_UCFSR_R_DIVBYZERO_MASK    (SCB_UCFSR_DIVBYZERO_MASK << SCB_UCFSR_R_DIVBYZERO_BIT)
#define SCB_UCFSR_R_DIVBYZERO_INACTIVE    (SCB_UCFSR_DIVBYZERO_INACTIVE << SCB_UCFSR_R_DIVBYZERO_BIT)
#define SCB_UCFSR_R_DIVBYZERO_ACTIVE    (SCB_UCFSR_DIVBYZERO_ACTIVE << SCB_UCFSR_R_DIVBYZERO_BIT)
#define SCB_UCFSR_R_DIVBYZERO_CLEAR    (SCB_UCFSR_DIVBYZERO_CLEAR << SCB_UCFSR_R_DIVBYZERO_BIT)
/*----------*/

