LaloAlvarez-e/ALIENTEK-STM32F767-/STM32F767_DriverLib/xDriver_MCU/Core/SCB/Peripheral/Register/RegisterDefines/SCB_RegisterDefines.h
#define SCB_MCFSR_R_MUNSTKERR_BIT    (3UL)

#define SCB_MCFSR_R_MUNSTKERR_MASK    (SCB_MCFSR_MUNSTKERR_MASK << SCB_MCFSR_R_MUNSTKERR_BIT)
#define SCB_MCFSR_R_MUNSTKERR_INACTIVE    (SCB_MCFSR_MUNSTKERR_INACTIVE << SCB_MCFSR_R_MUNSTKERR_BIT)
#define SCB_MCFSR_R_MUNSTKERR_ACTIVE    (SCB_MCFSR_MUNSTKERR_ACTIVE << SCB_MCFSR_R_MUNSTKERR_BIT)
#define SCB_MCFSR_R_MUNSTKERR_CLEAR    (SCB_MCFSR_MUNSTKERR_CLEAR << SCB_MCFSR_R_MUNSTKERR_BIT)
/*----------*/

/*----------*/
#define SCB_MCFSR_MSTKERR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_MCFSR_MSTKERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_MCFSR_MSTKERR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_MCFSR_MSTKERR_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_MCFSR_R_MSTKERR_BIT    (4UL)

#define SCB_MCFSR_R_MSTKERR_MASK    (SCB_MCFSR_MSTKERR_MASK << SCB_MCFSR_R_MSTKERR_BIT)
#define SCB_MCFSR_R_MSTKERR_INACTIVE    (SCB_MCFSR_MSTKERR_INACTIVE << SCB_MCFSR_R_MSTKERR_BIT)
#define SCB_MCFSR_R_MSTKERR_ACTIVE    (SCB_MCFSR_MSTKERR_ACTIVE << SCB_MCFSR_R_MSTKERR_BIT)
#define SCB_MCFSR_R_MSTKERR_CLEAR    (SCB_MCFSR_MSTKERR_CLEAR << SCB_MCFSR_R_MSTKERR_BIT)
/*----------*/

/*----------*/
#define SCB_MCFSR_MLSPERR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_MCFSR_MLSPERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_MCFSR_MLSPERR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_MCFSR_MLSPERR_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_MCFSR_R_MLSPERR_BIT    (5UL)

#define SCB_MCFSR_R_MLSPERR_MASK    (SCB_MCFSR_MLSPERR_MASK << SCB_MCFSR_R_MLSPERR_BIT)
#define SCB_MCFSR_R_MLSPERR_INACTIVE    (SCB_MCFSR_MLSPERR_INACTIVE << SCB_MCFSR_R_MLSPERR_BIT)
#define SCB_MCFSR_R_MLSPERR_ACTIVE    (SCB_MCFSR_MLSPERR_ACTIVE << SCB_MCFSR_R_MLSPERR_BIT)
#define SCB_MCFSR_R_MLSPERR_CLEAR    (SCB_MCFSR_MLSPERR_CLEAR << SCB_MCFSR_R_MLSPERR_BIT)
/*----------*/

/*----------*/
#define SCB_MCFSR_MMARVALID_MASK    ((UBase_t) 0x00000001UL)
#define SCB_MCFSR_MMARVALID_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_MCFSR_MMARVALID_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_MCFSR_MMARVALID_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_MCFSR_R_MMARVALID_BIT    (7UL)

#define SCB_MCFSR_R_MMARVALID_MASK    (SCB_MCFSR_MMARVALID_MASK << SCB_MCFSR_R_MMARVALID_BIT)
#define SCB_MCFSR_R_MMARVALID_INACTIVE    (SCB_MCFSR_MMARVALID_INACTIVE << SCB_MCFSR_R_MMARVALID_BIT)
#define SCB_MCFSR_R_MMARVALID_ACTIVE    (SCB_MCFSR_MMARVALID_ACTIVE << SCB_MCFSR_R_MMARVALID_BIT)
#define SCB_MCFSR_R_MMARVALID_CLEAR    (SCB_MCFSR_MMARVALID_CLEAR << SCB_MCFSR_R_MMARVALID_BIT)
/*----------*/
/********************************************************************************************/
/************************************* 14 HFSR ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_HFSR_VECTTBL_MASK    ((UBase_t) 0x00000001UL)
#define SCB_HFSR_VECTTBL_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_HFSR_VECTTBL_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_HFSR_VECTTBL_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_HFSR_R_VECTTBL_BIT    (1UL)

#define SCB_HFSR_R_VECTTBL_MASK    (SCB_HFSR_VECTTBL_MASK << SCB_HFSR_R_VECTTBL_BIT)
#define SCB_HFSR_R_VECTTBL_INACTIVE    (SCB_HFSR_VECTTBL_INACTIVE << SCB_HFSR_R_VECTTBL_BIT)
#define SCB_HFSR_R_VECTTBL_ACTIVE    (SCB_HFSR_VECTTBL_ACTIVE << SCB_HFSR_R_VECTTBL_BIT)
#define SCB_HFSR_R_VECTTBL_CLEAR    (SCB_HFSR_VECTTBL_CLEAR << SCB_HFSR_R_VECTTBL_BIT)
/*----------*/

/*----------*/
#define SCB_HFSR_FORCED_MASK    ((UBase_t) 0x00000001UL)
#define SCB_HFSR_FORCED_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_HFSR_FORCED_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_HFSR_FORCED_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_HFSR_R_FORCED_BIT    (30UL)

#define SCB_HFSR_R_FORCED_MASK    (SCB_HFSR_FORCED_MASK << SCB_HFSR_R_FORCED_BIT)
#define SCB_HFSR_R_FORCED_INACTIVE    (SCB_HFSR_FORCED_INACTIVE << SCB_HFSR_R_FORCED_BIT)
#define SCB_HFSR_R_FORCED_ACTIVE    (SCB_HFSR_FORCED_ACTIVE << SCB_HFSR_R_FORCED_BIT)
#define SCB_HFSR_R_FORCED_CLEAR    (SCB_HFSR_FORCED_CLEAR << SCB_HFSR_R_FORCED_BIT)
/*----------*/

/*----------*/
#define SCB_HFSR_DEBUGEVT_MASK    ((UBase_t) 0x00000001UL)

#define SCB_HFSR_R_DEBUGEVT_BIT    (30UL)

#define SCB_HFSR_R_DEBUGEVT_MASK    (SCB_HFSR_DEBUGEVT_MASK << SCB_HFSR_R_DEBUGEVT_BIT)
/*----------*/

/********************************************************************************************/
/************************************* 15 MMFAR ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_MMFAR_ADDRESS_MASK    ((UBase_t) 0xFFFFFFFFUL)

#define SCB_MMFAR_R_ADDRESS_BIT    (0UL)

#define SCB_MMFAR_R_ADDRESS_MASK    (SCB_MMFAR_ADDRESS_MASK << SCB_MMFAR_R_ADDRESS_BIT)
/*----------*/

/********************************************************************************************/
/************************************* 16 BFAR ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_BFAR_ADDRESS_MASK    ((UBase_t) 0xFFFFFFFFUL)

#define SCB_BFAR_R_ADDRESS_BIT    (0UL)

#define SCB_BFAR_R_ADDRESS_MASK    (SCB_BFAR_ADDRESS_MASK << SCB_BFAR_R_ADDRESS_BIT)
/*----------*/

/********************************************************************************************/
/************************************* 17 AFSR ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_AFSR_IMPDEF_MASK    ((UBase_t) 0xFFFFFFFFUL)

#define SCB_AFSR_R_IMPDEF_BIT    (0UL)

#define SCB_AFSR_R_IMPDEF_MASK    (SCB_AFSR_IMPDEF_MASK << SCB_AFSR_R_IMPDEF_BIT)
/*----------*/

/********************************************************************************************/
/************************************* 18 PFR0 ***********************************************/
/********************************************************************************************/

